var college = ['北京大学','中国人民大学','清华大学','北京航空航天大学','北京理工大学','中国农业大学','北京师范大学','中央民族大学','南开大学','天津大学','大连理工大学','东北大学','吉林大学','哈尔滨工业大学','复旦大学','同济大学','上海交通大学','华东师范大学','南京大学','东南大学','浙江大学','中国科学技术大学','厦门大学','山东大学','中国海洋大学','武汉大学','湖南大学','中山大学','华南理工大学','重庆大学','电子科技大学','西安交通大学','西北工业大学','兰州大学','四川大学','西北农林科技大学','中南大学','华中科技大学','东北大学秦皇岛分校','山东大学威海分校','哈尔滨工业大学(威海)','北京交通大学','北京工业大学','北京科技大学','北京化工大学','北京邮电大学','北京林业大学','北京协和医学院','北京中医药大学','北京外国语大学','中央财经大学','对外经济贸易大学','北京体育大学','中央音乐学院','中国政法大学','华北电力大学','华北电力大学(保定)','河北工业大学','太原理工大学','内蒙古大学','辽宁大学','大连海事大学','延边大学','东北师范大学','哈尔滨工程大学','东北林业大学','华东理工大学','东华大学','上海外国语大学','上海财经大学','苏州大学','南京航空航天大学','南京理工大学','中国矿业大学','河海大学','江南大学','南京农业大学','中国药科大学','南京师范大学','安徽大学','合肥工业大学','福州大学','郑州大学','华中农业大学','华中师范大学','湖南师范大学','暨南大学','华南师范大学','海南大学','广西大学','西南交通大学','四川农业大学','西南大学','西南财经大学','贵州大学','云南大学','西藏大学','西北大学','西安电子科技大学','陕西师范大学','青海大学','宁夏大学','新疆大学','石河子大学','中国矿业大学(北京)','中国地质大学(北京)','南昌大学','上海大学','天津医科大学','长安大学','中南财经政法大学','武汉理工大学','东北农业大学','国防科学技术大学','中国人民解放军第二军医大学','第四军医大学','上海交通大学医学院','中国传媒大学','中国地质大学(武汉)','中国石油大学(北京)','中国石油大学(华东)','北方工业大学','北京服装学院','北京印刷学院','北京建筑工程学院','北京石油化工学院','北京电子科技学院','北京农学院','首都医科大学','首都师范大学','首都体育学院','北京第二外国语学院','北京语言大学','北京物资学院','外交学院','中国人民公安大学','国际关系学院','中国音乐学院','中央美术学院','中央戏剧学院','中国戏曲学院','北京电影学院','北京舞蹈学院','天津科技大学','天津工业大学','中国民航大学','天津理工大学','天津农学院','天津中医药大学','天津师范大学','天津外国语大学','天津商业大学','天津体育学院','天津音乐学院','天津美术学院','河北大学','石家庄经济学院','河北科技大学','河北建筑工程学院','河北工程技术高等专科学校','承德医学院','河北师范大学','河北民族师范学院','唐山师范学院','廊坊师范学院','邢台学院','沧州师范学院','石家庄铁道大学','山西大学','山西农业大学','山西医科大学','长治医学院','山西师范大学','太原师范学院','晋中学院','运城学院','忻州师范学院','山西财经大学','内蒙古工业大学','内蒙古医学院','内蒙古师范大学','内蒙古财经大学','沈阳工业大学','沈阳航空航天大学','辽宁科技大学','辽宁工程技术大学','辽宁石油化工大学','沈阳化工大学','大连工业大学','辽宁工业大学','沈阳农业大学','大连海洋大学','中国医科大学','辽宁医学院','大连医科大学','辽宁中医药大学','沈阳药科大学','沈阳医学院','辽宁师范大学','沈阳师范大学','鞍山师范学院','朝阳师范高等专科学校','大连外国语学院','东北财经大学','中国刑事警察学院','沈阳体育学院','沈阳音乐学院','鲁迅美术学院','抚顺师范高等专科学校','锦州师范高等专科学校','铁岭师范高等专科学校','长春理工大学','东北电力大学','长春工业大学','吉林建筑工程学院','吉林化工学院','吉林农业大学','通化师范学院','吉林师范大学','吉林工程技术师范学院','长春师范学院','白城师范学院','吉林财经大学','吉林体育学院','吉林艺术学院','黑龙江大学','燕山大学','黑龙江科技学院','东北石油大学','齐齐哈尔大学','黑龙江八一农垦大学','哈尔滨医科大学','黑龙江中医药大学','牡丹江医学院','哈尔滨师范大学','牡丹江师范学院','大庆师范学院','绥化学院','哈尔滨商业大学','哈尔滨体育学院','哈尔滨金融学院','上海理工大学','上海电力学院','上海医疗器械高等专科学校','上海海洋大学','上海中医药大学','上海师范大学','上海对外贸易学院','华东政法大学','上海体育学院','上海音乐学院','上海戏剧学院','上海公安高等专科学校','南京工业大学','常州大学','南京林业大学','江苏大学','盐城工学院','南京医科大学','徐州医学院','南京中医药大学','徐州师范大学','淮阴师范学院','盐城师范学院','江苏警官学院','南京体育学院','南京艺术学院','常熟理工学院','浙江工业大学','浙江理工大学','浙江海洋学院','浙江农林大学','温州医学院','浙江中医药大学','浙江师范大学','杭州师范大学','湖州师范学院','绍兴文理学院','台州学院','中国美术学院','中国计量学院','安徽工业大学','安徽理工大学','安徽工程大学','安徽农业大学','安徽医科大学','蚌埠医学院','皖南医学院','安徽中医学院','安徽师范大学','阜阳师范学院','安庆师范学院','淮北师范大学','黄山学院','巢湖学院','淮南师范学院','铜陵学院','华侨大学','福建工程学院','福建医科大学','福建中医药大学','福建师范大学','闽江学院','宁德师范学院','泉州师范学院','漳州师范学院','华东交通大学','南昌航空大学','景德镇陶瓷学院','江西农业大学','江西中医学院','赣南医学院','江西师范大学','上饶师范学院','赣南师范学院','江西财经大学','山东科技大学','青岛科技大学','山东建筑大学','山东轻工业学院','山东农业大学','青岛农业大学','潍坊医学院','泰山医学院','滨州医学院','山东中医药大学','济宁医学院','菏泽医学专科学校','山东师范大学','曲阜师范大学','聊城大学','德州学院','临沂大学','泰山学院','山东经济学院','山东艺术学院','郑州轻工业学院','河南科技大学','中原工学院','河南农业大学','郑州牧业工程高等专科学校','河南中医学院','新乡医学院','河南大学','河南师范大学','信阳师范学院','周口师范学院','安阳师范学院','许昌学院','南阳师范学院','洛阳师范学院','商丘师范学院','河南财经政法大学','郑州航空工业管理学院','武汉工程大学','武汉纺织大学','武汉工业学院','湖北中医药大学','湖北大学','湖北师范学院','黄冈师范学院','湖北民族学院','郧阳师范高等专科学校','襄樊学院','武汉体育学院','湖北美术学院','中南民族大学','湖北汽车工业学院','孝感学院','湘潭大学','吉首大学','湖南农业大学','中南林业科技大学','湖南中医药大学','湖南理工学院','衡阳师范学院','怀化学院','湖南文理学院','湖南商学院','汕头大学','华南农业大学','广东海洋大学','广州医学院','广东医学院','广州中医药大学','广东药学院','韶关学院','惠州学院','韩山师范学院','湛江师范学院','肇庆学院','嘉应学院','广东培正学院','广州体育学院','广州美术学院','星海音乐学院','广东技术师范学院','深圳大学','广东商学院','广西工学院','桂林电子科技大学','桂林理工大学','广西医科大学','右江民族医学院','广西中医药大学','桂林医学院','广西师范大学','广西师范学院','广西民族师范学院','河池学院','玉林师范学院','广西艺术学院','广西民族大学','百色学院','西南石油大学','成都理工大学','重庆邮电大学','重庆交通大学','西南科技大学','成都信息工程学院','中国民用航空飞行学院','重庆医科大学','泸州医学院','成都中医药大学','川北医学院','四川师范大学','绵阳师范学院','内江师范学院','宜宾学院','重庆三峡学院','四川文理学院','阿坝师范高等专科学校','长江师范学院','乐山师范学院','四川外语学院','西南政法大学','成都体育学院','四川音乐学院','四川美术学院','贵阳医学院','遵义医学院','贵阳中医学院','贵州师范大学','遵义师范学院','兴义民族师范学院','黔南民族师范学院','贵州财经大学','贵州民族大学','昆明理工大学','云南农业大学','西南林业大学','昆明医科大学','大理学院','云南中医学院','云南师范大学','昭通师范高等专科学校','曲靖师范学院','普洱学院','云南艺术学院','西藏民族学院','西藏藏医学院','西安理工大学','西安工业大学','西安建筑科技大学','陕西科技大学','西安工程大学','陕西中医学院','延安大学','咸阳师范学院','渭南师范学院','西安外国语大学','西安体育学院','西安音乐学院','西安美术学院','兰州理工大学','甘肃农业大学','甘肃中医学院','西北师范大学','兰州城市学院','天水师范学院','河西学院','兰州商学院','青海师范大学','青海民族大学','宁夏医科大学','塔里木大学','新疆农业大学','新疆师范大学','喀什师范学院','伊犁师范学院','和田师范专科学校','新疆艺术学院','天津城市建设学院','河北科技师范学院','山西中医学院','吕梁学院','呼伦贝尔学院','广东白云学院','公安海警学院','上海工程技术大学','青岛滨海学院','浙江万里学院','安徽建筑工业学院','江西医学院上饶分院','景德镇高等专科学校','萍乡高等专科学校','枣庄学院','山东工艺美术学院','平顶山学院','咸宁学院','湖北医药学院','六盘水师范学院','新疆工程学院','新疆警察学院','昌吉学院','天津职业大学','沈阳大学','抚顺职业技术学院','牡丹江大学','淮阴工学院','镇江市高等专科学校','南通职业大学','徐州工程学院','常州工学院','浙江科技学院','宁波工程学院','合肥学院','烟台大学','铁道警官高等专科学校','中州大学','开封大学','洛阳理工学院','新乡学院','江汉大学','广州大学','成都大学','海南大学三亚学院','华北科技学院','中国人民武装警察部队学院','广州航海高等专科学校','广东警官学院','南华工商学院','成都电子机械高等专科学校','扬州大学','私立华联学院','齐齐哈尔医学院','北京信息科技大学','河北体育学院','太原大学','辽宁农业职业技术学院','阜新高等专科学校','大连民族学院','大连大学','南京审计学院','沙洲职业工学院','温州大学','淮南联合大学','福建商业高等专科学校','江西科技师范大学','信阳农业高等专科学校','湖南科技学院','河南机电高等专科学校','湖北警官学院','鄂州职业大学','五邑大学','广西体育高等专科学校','攀枝花学院','玉溪师范学院','楚雄师范学院','甘肃政法学院','北方民族大学','北京联合大学','北京城市学院','集宁师范学院','辽宁警官高等专科学校','长春汽车工业高等专科学校','长春金融高等专科学校','吉林警察学院','佳木斯大学','鸡西大学','扬州市职业大学','江苏技术师范学院','南京森林警察学院','浙江水利水电专科学校','浙江财经学院','莆田学院','福建华南女子职业学院','辽宁交通高等专科学校','江西警察学院','九江职业大学','新余学院','山东交通学院','焦作大学','武汉音乐学院','湖南财政经济学院','湖南警察学院','湖南女子学院','柳州师范高等专科学校','邕江大学','四川烹饪高等专科学校','成都纺织高等专科学校','文山学院','昆明冶金高等专科学校','甘肃民族师范学院','甘肃联合大学','乌鲁木齐职业大学','中国青年政治学院','北京青年政治学院','河套学院','淮海工学院','宁波大学','河南商业高等专科学校','河南财政税务高等专科学校','南阳理工学院','武汉商业服务学院','广东石油化工学院','海南师范大学','重庆理工大学','四川民族学院','西安邮电大学','山东工商学院','呼和浩特民族学院','长春大学','上海出版印刷高等专科学校','西安航空学院','河南城建学院','防灾科技学院','承德石油高等专科学校','仰恩大学','河南警察学院','湖北财经高等专科学校','兰州工业高等专科学校','海南医学院','新疆维吾尔医学专科学校','东莞理工学院','邢台职业技术学院','山东财政学院','长春医学高等专科学校','桂林师范高等专科学校','桂林航天工业学院','西安电力高等专科学校','郑州电力高等专科学校','首钢工学院','上海杉达学院','黄河科技学院','上海政法学院','桂林旅游高等专科学校','民办四川天一学院','浙江树人学院','长沙航空职业技术学院','集美大学','宝鸡文理学院','青岛大学','郑州澍青医学高等专科学校','天津医学高等专科学校','佛山科学技术学院','广东外语外贸大学','广东工业大学','首都经济贸易大学','三江学院','哈尔滨理工大学','武汉科技大学','重庆电力高等专科学校','黑龙江东方学院','河北经贸大学','河北医科大学','河北农业大学','北京工商大学','内蒙古农业大学','北华大学','新疆医科大学','嘉兴学院','长春工程学院','山西警官高等专科学校','哈尔滨学院','黑龙江工程学院','南京晓庄学院','皖西学院','潍坊学院','三峡大学','南华大学','四川警察学院','宜春学院','连云港师范高等专科学校','上海应用技术学院','济南大学','内蒙古民族大学','福建农林大学','湖南工程学院','南京工程学院','苏州科技学院','陕西理工学院','西安财经学院','中华女子学院','九江学院','浙江医药高等专科学校','泰州师范高等专科学校','湖北经济学院','鹤岗师范高等专科学校','唐山学院','安徽医学高等专科学校','邵阳学院','亳州师范高等专科学校','邢台医学高等专科学校','湖北中医药高等专科学校','湖南城市学院','焦作师范高等专科学校','安徽中医药高等专科学校','郑州师范学院','山东理工大学','中央司法警官学院','安徽新华学院','烟台南山学院','湘潭大学兴湘学院','重庆大学城市科技学院','华南理工大学广州学院','广州大学华软软件学院','中山大学南方学院','广东外语外贸大学南国商学院','广东商学院华商学院','广东海洋大学寸金学院','华南农业大学珠江学院','湖南师范大学树达学院','湖南文理学院芙蓉学院','湖南理工学院南湖学院','衡阳师范学院南岳学院','湖南中医药大学湘杏学院','广东技术师范学院天河学院','东南大学成贤学院','西安欧亚学院','上海建桥学院','福建师范大学闽南科技学院','福建农林大学东方学院','武汉大学珞珈学院','沈阳建筑大学城市建设学院','大连医科大学中山学院','辽宁师范大学海华学院','湖北工业大学工程技术学院','湖北民族学院科技学院','湖北经济学院法商学院','武汉体育学院体育科技学院','襄樊学院理工学院','孝感学院新技术学院','浙江工业大学之江学院','浙江师范大学行知学院','宁波大学科学技术学院','杭州电子科技大学信息工程学院','浙江理工大学科技与艺术学院','浙江海洋学院东海科学技术学院','浙江农林大学天目学院','温州医学院仁济学院','浙江中医药大学滨江学院','湖州师范学院求真学院','绍兴文理学院元培学院','温州大学瓯江学院','浙江工商大学杭州商学院','嘉兴学院南湖学院','浙江财经学院东方学院','东北石油大学华瑞学院','哈尔滨剑桥学院','青岛理工大学琴岛学院','中国石油大学胜利学院','赣南师范学院科技学院','福州大学阳光学院','福州大学至诚学院','河南师范大学新联学院','信阳师范学院华锐学院','安阳师范学院人文管理学院','河南理工大学万方科技学院','兰州交通大学博文学院','兰州理工大学技术工程学院','山西大学商务学院','山西农业大学信息学院','新疆大学科学技术学院','新疆农业大学科学技术学院','无锡太湖学院','重庆师范大学涉外商贸学院','吉林动画学院','安徽工程大学机电学院','安徽工业大学工商学院','安徽师范大学皖江学院','安徽医科大学临床医学院','阜阳师范学院信息工程学院','吉林师范大学博达学院','长春大学旅游学院','山东科技大学泰山科技学院','上海外国语大学贤达经济人文学院','温州大学城市学院','广西师范大学漓江学院','广西师范学院师园学院','南京大学金陵学院','贵州民族学院人文科技学院','遵义医学院医学与科技学院','南京理工大学紫金学院','广东工业大学华立学院','广州大学松田学院','成都理工大学工程技术学院','四川师范大学成都学院','西安交通大学城市学院','西北大学现代学院','成都医学院','吉林医药学院','黑河学院','南京理工大学泰州科技学院','东莞理工学院城市学院','北京航空航天大学北海学院','上海师范大学天华学院','中山大学新华学院','四川大学锦城学院','南京师范大学中北学院','南京医科大学康达学院','南京中医药大学翰林学院','苏州大学文正学院','苏州大学应用技术学院','苏州科技学院天平学院','扬州大学广陵学院','徐州师范大学科文学院','南京财经大学红山学院','南通大学杏林学院','青岛工学院','曲阜师范大学杏坛学院','山东师范大学历山学院','聊城大学东昌学院','商丘学院','华中农业大学楚天学院','西南财经大学天府学院','四川大学锦江学院','河南财经政法大学成功学院','西安理工大学高科学院','西安科技大学高新学院','四川音乐学院绵阳艺术学院','西南科技大学城市学院','福建农林大学金山学院','天津财经大学珠江学院','山东政法学院','北京师范大学-香港浸会大学联合国际学院','浙江大学宁波理工学院','北京师范大学珠海分校','大连理工大学城市学院','浙江大学城市学院','武汉东湖学院','汉口学院','电子科技大学中山学院','武昌理工学院','华中科技大学武昌分校','四川理工学院','辽东学院','解放军信息工程大学','解放军理工大学','解放军外国语学院','解放军西安通信学院','中国人民解放军炮兵学院','郑州防空兵学院','海军工程大学','中国人民解放军海军飞行学院','空军工程大学','桂林空军学院','空军第一航空学院','北京工业职业技术学院','北京信息职业技术学院','北京电子科技职业学院','北京科技经营管理学院','北京吉利大学','北京农业职业学院','北京戏曲艺术职业学院','北京京北职业技术学院','北京经贸职业学院','北京经济技术职业学院','北京北大方正软件职业技术学院','北京财贸职业学院','天津滨海职业学院','天津工程职业技术学院','天津现代职业技术学院','天津轻工职业技术学院','天津电子信息职业技术学院','天津公安警官职业学院','天津机电职业技术学院','天津渤海职业技术学院','天津中德职业技术学院','天津青年职业学院','天津对外经济贸易职业学院','天津交通职业学院','天津开发区职业技术学院','河北工业职业技术学院','邯郸职业技术学院','石家庄职业技术学院','张家口职业技术学院','沧州职业技术学院','石家庄铁路职业技术学院','河北能源职业技术学院','保定职业技术学院','河北建材职业技术学院','河北政法职业学院','河北石油职业技术学院','衡水职业技术学院','秦皇岛职业技术学院','唐山职业技术学院','唐山工业职业技术学院','石家庄计算机职业学院','石家庄法商职业学院','河北省艺术职业学院','河北交通职业技术学院','河北化工医药职业技术学院','河北外国语职业学院','石家庄信息工程职业学院','石家庄外经贸职业学院','河北美术学院','山西建筑职业技术学院','山西工程职业技术学院','晋城职业技术学院','大同煤炭职业技术学院','山西生物应用职业技术学院','山西交通职业技术学院','山西兴华职业学院','长治职业技术学院','山西艺术职业学院','阳泉职业技术学院','山西水利职业技术学院','山西林业职业技术学院','山西财贸职业技术学院','山西戏剧职业学院','山西机电职业技术学院','临汾职业技术学院','山西职业技术学院','太原城市职业技术学院','山西煤炭职业技术学院','包头职业技术学院','内蒙古建筑职业技术学院','兴安职业技术学院','内蒙古警察职业学院','内蒙古体育职业学院','包头轻工职业技术学院','呼和浩特职业学院','渤海船舶职业学院','盘锦职业技术学院','辽宁金融职业学院','大连职业技术学院','大连商务职业学院','辽阳职业技术学院','营口职业技术学院','大连艺术职业学院','辽宁石化职业技术学院','辽宁经济职业技术学院','辽宁机电职业技术学院','辽宁广告职业学院','辽宁信息职业技术学院','辽宁体育运动职业技术学院','辽宁林业职业技术学院','沈阳航空职业技术学院','沈阳职业技术学院','吉林交通职业技术学院','辽源职业技术学院','长春东方职业学院','吉林电子信息职业技术学院','吉林工业职业技术学院','吉林司法警官职业学院','吉林农业工程职业技术学院','长春职业技术学院','黑龙江建筑职业技术学院','伊春职业学院','黑龙江司法警官职业学院','齐齐哈尔工程学院','黑龙江林业职业技术学院','黑龙江农业职业技术学院','黑龙江农业工程职业学院','大庆职业学院','黑龙江农垦职业学院','哈尔滨职业技术学院','哈尔滨电力职业技术学院','哈尔滨铁道职业技术学院','大兴安岭职业学院','黑龙江畜牧兽医职业学院','黑龙江农业经济职业学院','黑龙江艺术职业学院','哈尔滨华夏计算机职业技术学院','黑龙江工商职业技术学院','上海建峰职业技术学院','上海第二工业大学','上海科学技术职业学院','上海海事职业技术学院','上海电子信息职业技术学院','上海交通职业技术学院','上海城市管理职业技术学院','上海行健职业学院','上海农林职业技术学院','民办明达职业技术学院','连云港职业技术学院','南京工业职业技术学院','徐州建筑职业技术学院','泰州职业技术学院','无锡职业技术学院','南通纺织职业技术学院','苏州工艺美术职业技术学院','常州信息职业技术学院','南通航运职业技术学院','无锡商业职业技术学院','南京交通职业技术学院','淮安信息职业技术学院','江苏畜牧兽医职业技术学院','常州纺织服装职业技术学院','苏州农业职业技术学院','苏州工业园区职业技术学院','南京化工职业技术学院','正德职业技术学院','无锡南洋职业技术学院','钟山职业技术学院','炎黄职业技术学院','金肯职业技术学院','紫琅职业技术学院','九州职业技术学院','硅湖职业技术学院','江阴职业技术学院','宿迁职业技术学院','南京信息职业技术学院','常州工程职业技术学院','常州轻工职业技术学院','常州机电职业技术学院','徐州工业职业技术学院','江苏食品职业技术学院','江苏农林职业技术学院','江苏信息职业技术学院','南京特殊教育职业技术学院','浙江艺术职业学院','浙江交通职业技术学院','杭州职业技术学院','义乌工商职业技术学院','宁波职业技术学院','温州职业技术学院','浙江工商职业技术学院','浙江工贸职业技术学院','台州职业技术学院','浙江机电职业技术学院','浙江商业职业技术学院','浙江警官职业学院','浙江工业职业技术学院','浙江旅游职业学院','浙江金融职业学院','浙江经济职业技术学院','浙江建设职业技术学院','浙江经贸职业技术学院','浙江育英职业技术学院','绍兴职业技术学院','嘉兴职业技术学院','湖州职业技术学院','衢州职业技术学院','丽水职业技术学院','浙江东方职业技术学院','安徽职业技术学院','淮北职业技术学院','芜湖职业技术学院','民办万博科技职业学院','铜陵职业技术学院','安徽商贸职业技术学院','安徽警官职业学院','安徽水利水电职业技术学院','淮南职业技术学院','安徽电子信息职业技术学院','安徽工贸职业技术学院','安徽工业经济职业技术学院','安徽交通职业技术学院','安徽体育运动职业技术学院','阜阳职业技术学院','合肥通用职业技术学院','六安职业技术学院','安徽文达信息工程学院','民办合肥经济技术职业学院','宿州职业技术学院','安徽广播影视职业技术学院','池州职业技术学院','滁州职业技术学院','宣城职业技术学院','安徽外国语学院','巢湖职业技术学院','福建交通职业技术学院','福州职业技术学院','福州英华职业学院','厦门华夏职业学院','漳州职业技术学院','泉州华光摄影艺术职业学院','福建信息职业技术学院','福建水利电力职业技术学院','福建电力职业技术学院','福建林业职业技术学院','福建农业职业技术学院','厦门海洋职业技术学院','九江职业技术学院','江西工业职业技术学院','江西蓝天学院','江西司法警官职业学院','江西电力职业技术学院','江西旅游商贸职业学院','江西机电职业技术学院','江西陶瓷工艺美术职业技术学院','江西环境工程职业学院','江西信息应用职业技术学院','江西工业工程职业技术学院','江西交通职业技术学院','江西艺术职业学院','江西财经职业学院','江西应用技术职业学院','鹰潭职业技术学院','江西现代职业技术学院','山东商业职业技术学院','日照职业技术学院','山东水利职业学院','山东职业学院（原济南铁道职业技术学院学院）','莱芜职业技术学院','威海职业学院','青岛职业技术学院','聊城职业技术学院','济宁职业技术学院','山东劳动职业技术学院','曲阜远东职业技术学院','烟台职业学院','滨州职业学院','潍坊职业学院','东营职业学院','山东服装职业学院','德州科技职业学院','山东力明科技职业学院','山东畜牧兽医职业学院','山东圣翰财贸职业学院','淄博职业学院','山东交通职业学院','山东信息职业技术学院','山东外贸职业学院','青岛酒店管理职业技术学院','山东大王职业学院','青岛飞洋职业技术学院','淄博科技职业学院','河南职业技术学院','漯河职业技术学院','黄河水利职业技术学院','三门峡职业技术学院','郑州铁路职业技术学院','濮阳职业技术学院','许昌职业技术学院','鹤壁职业技术学院','商丘职业技术学院','河南工业职业技术学院','河南司法警官职业学院','平顶山工业职业技术学院','济源职业技术学院','周口职业技术学院','武汉职业技术学院','武汉船舶职业技术学院','长江职业学院','黄冈职业技术学院','十堰职业技术学院','襄樊职业技术学院','恩施职业技术学院','湖北交通职业技术学院','湖北轻工职业技术学院','仙桃职业学院','荆州职业技术学院','武汉工程职业技术学院','武汉航海职业技术学院','武汉电力职业技术学院','湖北城市建设职业技术学院','湖北水利水电职业技术学院','武汉外语外事职业学院','武汉商贸职业学院','武汉科技职业学院','武汉信息传播职业技术学院','湖北开放职业学院','武汉警官职业学院','随州职业技术学院','长沙民政职业技术学院','湖南工业职业技术学院','湖南交通职业技术学院','怀化医学高等专科学校','湖南科技职业学院','湖南环境生物职业技术学院','湖南铁道职业技术学院','永州职业技术学院','湖南大众传媒职业技术学院','长沙通信职业技术学院','湘潭职业技术学院','湖南商务职业技术学院','郴州职业技术学院','娄底职业技术学院','张家界航空工业职业技术学院','湖南工程职业技术学院','长沙环境保护职业技术学院','湖南艺术职业学院','湖南体育职业学院','湖南机电职业技术学院','广州民航职业技术学院','广东轻工职业技术学院','顺德职业技术学院','广东交通职业技术学院','广东水利电力职业技术学院','深圳信息职业技术学院','深圳职业技术学院','潮汕职业技术学院','广东松山职业技术学院','广东农工商职业技术学院','佛山职业技术学院','广东新安职业技术学院','广东省外语艺术职业学院','广东机电职业技术学院','广东建设职业技术学院','广东纺织职业技术学院','广东女子职业技术学院','广东岭南职业技术学院','汕尾职业技术学院','河源职业技术学院','罗定职业技术学院','阳江职业技术学院','广东财经职业学院','揭阳职业技术学院','广东邮电职业技术学院','汕头职业技术学院','清远职业技术学院','广东亚视演艺职业学院','广东司法警官职业学院','广东工贸职业技术学院','广州康大职业技术学院','南海东软信息技术职业学院','珠海艺术职业学院','广西职业技术学院','广西机电职业技术学院','柳州职业技术学院','南宁职业技术学院','广西建设职业技术学院','广西水利电力职业技术学院','广西交通职业技术学院','广西农业职业技术学院','广西生态工程职业技术学院','广西国际商务职业技术学院','海南职业技术学院','重庆工业职业技术学院','重庆工程职业技术学院','重庆警官职业学院','重庆信息技术职业学院','重庆海联职业技术学院','重庆三峡职业学院','成都航空职业技术学院','四川交通职业技术学院','达州职业技术学院','四川机电职业技术学院','四川工程职业技术学院','四川电力职业技术学院','绵阳职业技术学院','四川工商职业技术学院','四川建筑职业技术学院','四川国际标榜职业学院','成都农业科技职业学院','宜宾职业技术学院','成都艺术职业学院','四川托普信息技术职业学院','四川职业技术学院','眉山职业技术学院','泸州职业技术学院','乐山职业技术学院','雅安职业技术学院','贵州航天职业技术学院','贵州交通职业技术学院','贵州电子信息职业技术学院','贵州警官职业学院','安顺职业技术学院','黔东南民族职业技术学院','黔南民族职业技术学院','贵州电力职业技术学院','铜仁职业技术学院','云南国土资源职业学院','云南交通职业技术学院','昆明艺术职业学院','西双版纳职业技术学院','玉溪农业职业技术学院','昆明工业职业技术学院','云南能源职业技术学院','云南农业职业技术学院','云南司法警官职业学院','陕西工业职业技术学院','杨凌职业技术学院','西安外事学院','陕西财经职业技术学院','陕西国防工业职业技术学院','陕西交通职业技术学院','陕西能源职业技术学院','陕西职业技术学院','西安航空职业技术学院','西安高新科技职业学院','陕西服装工程学院','西安三资职业学院','兰州石化职业技术学院','甘肃工业职业技术学院','甘肃建筑职业技术学院','甘肃警察职业学院','甘肃林业职业技术学院','酒泉职业技术学院','兰州外语职业学院','兰州职业技术学院','青海警官职业学院','青海畜牧兽医职业技术学院','青海交通职业技术学院','青海建筑职业技术学院','宁夏理工学院','宁夏工业职业学院','宁夏职业技术学院','宁夏财经职业技术学院','宁夏司法警官职业学院','宁夏建设职业技术学院','新疆农业职业技术学院','新疆机电职业技术学院','新疆轻工职业技术学院','克拉玛依职业技术学院','昌吉职业技术学院','伊犁职业技术学院','巴音郭楞职业技术学院','阿克苏职业技术学院','新疆建设职业技术学院','北京人民警察学院','广播电影电视管理干部学院','陕西航天职工大学','河北地质职工大学','江西管理职业学院','山西职工医学院','吉林省教育学院','黑龙江省农垦管理干部学院','黑龙江省政法管理干部学院','黑龙江省教育学院','江苏教育学院','宁波教育学院','江西教育学院','山东省经济管理干部学院','山东省农业管理干部学院','齐鲁师范学院','潍坊工程职业学院','河南教育学院','开封文化艺术职业学院','平顶山教育学院','湖北第二师范学院','南方动力机械公司职工工学院','广东第二师范学院','广西教育学院','四川教育学院','重庆教育学院','西安航空职工大学','西安飞机工业公司职工工学院','西安铁路工程职工大学','西安电力机械制造公司机电学院','陕西学前师范学院','甘肃机电职业技术学院','兰州铁路工程职工大学','石家庄职工大学','山西煤炭管理干部学院','山西青年职业学院','广东科学技术职业学院','吉林省经济管理干部学院','大庆医学高等专科学校','江苏省省级机关管理干部学院','安徽城市管理职业学院','闽北职业技术学院','福州教育学院','福建江夏学院','南昌教育学院','广东文艺职业学院','广东工程职业技术学院','广西警官高等专科学校','广西政法管理干部学院','陕西工运学院','白银矿冶职业技术学院','新疆教育学院','上海健康职业技术学院','北京经济管理职业学院','北京政法职业学院','南宁地区教育学院','辽宁商贸职业学院','辽宁文化艺术职工大学','兰州教育学院','河北管理干部学院','哈尔滨市职工医学院','黑龙江生态工程职业学院','武汉冶金管理干部学院','山东电力高等专科学校','山西政法管理干部学院','河北青年管理干部学院','江苏省青年管理干部学院','广东行政职业学院','辽宁公安司法管理干部学院','山东体育学院','山东省工会管理干部学院','山东青年政治学院','重庆民生职业技术学院','河北科技学院','石家庄外事职业学院','石家庄工商职业学院','山西华澳商贸职业学院','山西同文外语职业学院','山西老区职业技术学院','山西信息职业技术学院','山西工商学院','内蒙古丰州职业学院','内蒙古经贸外语职业学院','赤峰职业技术学院','内蒙古北方职业技术学院','内蒙古科技职业学院','大连翻译职业学院','辽宁美术职业学院','吉林华桥外国语学院','长春信息技术职业学院','哈尔滨现代公共关系职业学院','哈尔滨应用职业技术学院','上海新侨职业技术学院','上海东海职业技术学院','上海立达职业技术学院','上海民远职业技术学院','上海欧华职业技术学院','上海邦德职业技术学院','上海震旦职业学院','上海中侨职业技术学院','上海中华职业技术学院','苏州港大思培科技职业学院','应天职业技术学院','南京视觉艺术职业学院','建东职业技术学院','江海职业技术学院','昆山登云科技职业学院','江南影视艺术职业学院','苏州托普信息职业技术学院','太湖创意职业技术学院','金山职业技术学院','杭州万向职业技术学院','浙江长征职业技术学院','嘉兴南洋职业技术学院','浙江广厦建设职业技术学院','安徽绿海商务职业学院','合肥共达职业技术学院','蚌埠经济技术职业学院','民办合肥财经职业学院','安徽涉外经济职业学院','武夷山职业学院','泉州信息职业技术学院','福州黎明职业技术学院','厦门兴才职业技术学院','福州软件职业技术学院','泉州理工职业学院','福州外语外贸学院','漳州吉马印刷职业技术学院','漳州天福茶职业技术学院','厦门东海职业技术学院','厦门南洋职业学院','厦门软件职业技术学院','福州科技职业技术学院','福州海峡职业技术学院','江西渝州科技职业学院','江西科技职业学院','赣西科技职业学院','江西城市职业学院','山东外国语职业学院','潍坊工商职业学院','枣庄科技职业学院','山东凯文科技职业学院','山东现代职业学院','青岛黄海学院','山东华宇职业技术学院','山东协和学院','山东外事翻译职业学院','山东杏林科技职业学院','郑州交通职业学院','郑州电子信息职业技术学院','嵩山少林武术职业学院','郑州电力职业技术学院','商丘工学院','武汉工贸职业学院','黄冈科技职业学院','武汉语言文化职业学院','湖北科技职业学院','湖南科技经贸职业学院','湖南九嶷职业技术学院','湖南都市职业学院','湖南软件职业学院','长沙南方职业学院','潇湘职业学院','湖南外国语职业学院','湖南同德职业学院','湖南电子科技职业学院','湖南信息科学职业学院','肇庆科技职业技术学院','广东科技学院','惠州经济职业技术学院','广州科技职业技术学院','广州工商职业技术学院','广州珠江职业技术学院','广州松田职业学院','湛江现代科技职业学院','广州涉外经济职业技术学院','广州城建职业学院','肇庆工商职业技术学院','广州华南商贸职业学院','广州现代信息工程职业技术学院','广州华立科技职业学院','广西英华国际职业学院','广西城市职业学院','广西工程职业学院','广西外国语学院','广西演艺职业学院','北海艺术设计职业学院','桂林山水职业学院','三亚城市职业学院','重庆正大软件职业技术学院','四川科技职业学院','四川华新现代职业学院','四川文化传媒职业学院','贵州亚泰职业学院','云南新兴职业学院','云南经济管理职业学院','昆明扬帆职业技术学院','云南北美职业学院','云南工商学院','西安东方亚太职业技术学院','西安汽车科技职业学院','西安科技商贸职业学院','陕西电子科技职业学院','陕西旅游烹饪职业学院','银川科技职业学院','新疆能源职业技术学院','新疆天山职业技术学院','新疆现代职业技术学院','漳州城市职业学院','福建卫生职业技术学院','南昌师范高等专科学校','江西中医药高等专科学校','江西泰豪动漫职业学院','江西枫林涉外经贸职业学院','江西生物科技职业学院','江西航空职业技术学院','江西工程职业学院','江西青年职业学院','宜春职业技术学院','江西应用工程职业学院','江西经济管理职业学院','上饶职业技术学院','江西农业工程职业学院','江西护理职业技术学院','山东中医药高等专科学校','淄博师范高等专科学校','山东科技职业学院','山东城市建设职业学院','烟台汽车工程职业学院','山东司法警官职业学院','泰山职业技术学院','山东工业职业学院','德州职业技术学院','烟台工程职业技术学院','枣庄职业学院','临沂职业学院','山东传媒职业学院','山东化工职业学院','山东商务职业学院','山东经贸职业学院','济南职业学院','山东电子职业技术学院','山东丝绸纺织职业学院','山东铝业职业学院','菏泽家政职业学院','山东胜利职业学院','河南工业贸易职业学院','河南交通职业技术学院','河南经贸职业学院','河南农业职业学院','河南质量工程职业学院','漯河医学高等专科学校','南阳医学高等专科学校','商丘医学高等专科学校','信阳职业技术学院','郑州工业安全职业学院','郑州信息科技职业学院','郑州旅游职业学院','河南建筑职业技术学院','周口科技职业学院','沙市职业大学','江汉艺术职业学院','湖北艺术职业学院','湖北生物科技职业学院','咸宁职业技术学院','武汉工业职业技术学院','湖北生态工程职业技术学院','三峡电力职业学院','湖北财税职业学院','武汉软件工程职业学院','湖北青年职业学院','黄石职业技术学院','益阳医学高等专科学校','湖南中医药高等专科学校','邵阳医学高等专科学校','湖南信息职业技术学院','长沙电力职业技术学院','湖南水利水电职业技术学院','湖南现代物流职业技术学院','湖南交通工程职业技术学院','湖南铁路科技职业技术学院','湖南工艺美术职业学院','湖南民族职业学院','衡阳财经工业职业技术学院','湖南石油化工职业技术学院','湖南化工职业技术学院','怀化职业技术学院','湖南理工职业技术学院','湖南安全技术职业学院','长沙师范学校','湘西民族职业技术学院','益阳职业技术学院','湖南电气职业技术学院','株洲职业技术学院','湖南城建职业技术学院','湖南网络工程职业学院','长沙职业技术学院','长沙商贸旅游职业技术学院','邵阳职业技术学院','湖南对外经济贸易职业学院','湖南科技工业职业技术学院','肇庆医学高等专科学校','广州工程技术职业学院','珠海城市职业技术学院','广州铁路职业技术学院','广州体育职业技术学院','江门职业技术学院','广东科贸职业学院','茂名职业技术学院','中山职业技术学院','广州科技贸易职业学院','中山火炬职业技术学院','广东理工职业学院','广州城市职业学院','广东体育职业技术学院','广东食品药品职业学院','柳州医学高等专科学校','广西现代职业技术学院','北海职业学院','广西电力职业技术学院','广西工业职业技术学院','贵港职业学院','柳州铁道职业技术学院','广西工商职业技术学院','百色职业学院','柳州城市职业学院','广西理工职业技术学院','梧州职业学院','海南软件职业技术学院','海南科技职业学院','重庆三峡医药高等专科学校','重庆医药高等专科学校','重庆城市管理职业学院','重庆城市职业学院','重庆青年职业技术学院','重庆机电职业技术学院','重庆工商职业学院','重庆水利电力职业技术学院','重庆工贸职业技术学院','重庆电子工程职业学院','重庆财经职业学院','重庆科创职业学院','重庆建筑工程职业学院','四川中医药高等专科学校','内江职业技术学院','成都职业技术学院','四川管理职业学院','四川邮电职业技术学院','四川化工职业技术学院','四川水利职业技术学院','四川司法警官职业学院','四川信息职业技术学院','广安职业技术学院','四川商务职业学院','四川财经职业学院','四川艺术职业学院','四川城市职业学院','四川现代职业学院','遵义医药高等专科学校','贵阳护理职业学院','黔西南民族职业技术学院','贵州轻工职业技术学院','毕节职业技术学院','保山中医药高等专科学校','曲靖医学高等专科学校','楚雄医药高等专科学校','临沧师范高等专科学校','德宏师范高等专科学校','丽江师范高等专科学校','云南林业职业技术学院','云南体育运动职业技术学院','云南文化艺术职业学院','云南热带作物职业学院','云南机电职业技术学院','云南国防工业职业技术学院','云南锡业职业技术学院','拉萨师范高等专科学校','西藏职业技术学院','延安职业技术学院','汉中职业技术学院','商洛职业技术学院','西安职业技术学院','咸阳职业技术学院','陕西经济管理职业技术学院','宝鸡职业技术学院','陕西航空职业技术学院','陕西铁路工程职业技术学院','铜川职业技术学院','安康职业技术学院','渭南职业技术学院','张掖医学高等专科学校','平凉医学高等专科学校','陇南师范高等专科学校','定西师范高等专科学校','甘肃农业职业技术学院','甘肃畜牧工程职业技术学院','兰州资源环境职业技术学院','甘肃交通职业技术学院','武威职业学院','甘肃钢铁职业技术学院','青海卫生职业技术学院','宁夏民族职业技术学院','宁夏工商职业技术学院','新疆兵团警官高等专科学校','新疆石河子职业技术学院','新疆交通职业技术学院','新疆职业大学','天津商业大学宝德学院','大连工业大学艺术与信息工程学院','辽宁科技大学信息技术学院','辽宁医学院医疗学院','黑龙江工程学院昆仑旅游学院','杭州师范大学钱江学院','东华理工大学长江学院','青岛农业大学海都学院','华中师范大学武汉传媒学院','西南大学育才学院','云南艺术学院文华学院','新疆财经大学商务学院','江苏建康职业学院','衢州学院','安徽经济管理干部学院','南昌钢铁有限责任公司职工大学','长沙教育学院','湘潭教育学院','广西壮族自治区经济管理干部学院','中国工程物理研究院职工工学院','北京劳动保障职业学院','北京社会管理职业学院','天津工艺美术职业学院','天津艺术职业学院','天津国土资源和房屋职业学院','河北机电职业技术学院','河北司法警官职业学院','廊坊职业技术学院','河北公安警察职业学院','河北女子职业技术学院','河北旅游职业学院','冀中职业学院','石家庄科技工程职业学院','太原电力高等专科学校','运城幼儿师范高等专科学校','山西省财政税务专科学校','晋中职业技术学院','山西运城农业职业技术学院','太原旅游职业学院','山西管理职业学院','潞安职业技术学院','山西金融职业学院','山西体育职业学院','山西警官职业学院','山西国际商务职业学院','忻州职业技术学院','山西经贸职业学院','朔州职业技术学院','包头钢铁职业技术学院','锡林郭勒职业学院','内蒙古交通职业技术学院','科尔沁艺术职业学院','通辽职业学院','内蒙古电子信息职业技术学院','乌兰察布职业学院','乌海职业技术学院','内蒙古机电职业技术学院','内蒙古化工职业学院','内蒙古商贸职业学院','包头铁道职业技术学院','辽宁装备制造职业技术学院','辽河石油职业技术学院','辽宁职业学院','辽宁地质工程职业学院','辽宁铁道职业技术学院','辽宁建筑职业技术学院','松原职业技术学院','吉林铁道职业技术学院','白城职业技术学院','长白山职业技术学院','齐齐哈尔高等师范专科学校','黑龙江幼儿师范高等专科学校','黑龙江生物科技职业学院','黑龙江民族职业学院','七台河职业学院','黑龙江信息技术职业学院','黑龙江公安警官职业学院','黑龙江商业职业学院','黑龙江旅游职业技术学院','黑龙江煤炭职业技术学院','黑龙江交通职业技术学院','哈尔滨科学技术职业学院','黑龙江粮食职业学院','佳木斯职业学院','上海医药高等专科学校','上海旅游高等专科学校','上海工艺美术职业学院','上海工会管理职业学院','上海体育职业学院','苏州职业大学','南通农业职业技术学院','无锡科技职业学院','南京铁道职业技术学院','江苏联合职业技术学院','无锡工艺职业技术学院','南京机电职业技术学院','无锡城市职业技术学院','扬州环境资源职业技术学院','健雄职业技术学院','江苏财经职业技术学院','苏州工业职业技术学院','盐城纺织职业技术学院','扬州工业职业技术学院','江苏城市职业学院','苏州卫生职业技术学院','盐城卫生职业技术学院','苏州高博软件技术职业学院','南京旅游职业学院','浙江医学高等专科学校','金华职业技术学院','浙江国际海运职业技术学院','宁波城市职业技术学院','浙江纺织服装职业技术学院','宁波天一职业技术学院','浙江同济科技职业学院','浙江邮电职业技术学院','浙江体育职业技术学院','浙江电力职业技术学院','台州科技职业学院','温州科技职业学院','安庆医药高等专科学校','安徽工业职业技术学院','安徽工商职业学院','安徽邮电职业技术学院','安徽艺术职业学院','安徽国防科技职业学院','安徽林业职业技术学院','安徽新闻出版职业技术学院','安徽财贸职业学院','安徽电气工程职业技术学院','安庆职业技术学院','安徽公安职业学院','芜湖信息技术职业学院','安徽国际商务职业学院','马鞍山职业技术学院','徽商职业学院','民办安徽旅游职业学院','安徽冶金科技职业学院','安徽机电职业技术学院','安徽审计职业学院','亳州职业技术学院','安徽中澳科技职业学院','泉州医学高等专科学校','厦门医学高等专科学校','德化陶瓷职业技术学院','厦门城市职业学院','福建警官职业学院','福建生物工程职业技术学院','福建艺术职业学院','福建体育职业技术学院','宁德职业技术学院','泉州经贸职业技术学院','闽西职业技术学院','三明职业技术学院','湄洲湾职业技术学院','漳州卫生职业学院','天津天狮学院','保定学院','上海海关学院','浙江警察学院','宁波大红鹰学院','浙江越秀外国语学院','合肥师范学院','池州学院','蚌埠学院','安徽三联学院','福建警察学院','闽南理工学院','武夷学院','山东万杰医学院','潍坊科技学院','山东英才学院','河南工程学院','郑州华信学院','郑州科技学院','荆楚理工学院','湖南第一师范学院','仲恺农业工程学院','海口经济学院','西安思源学院','陕西国际商贸学院','安徽财经大学','保定电力职业技术学院','保险职业学院','北华航天工业学院','北京大学医学部','北京工商大学嘉华学院','北京工业大学耿丹学院','北京化工大学北方学院','北京汇佳职业学院','北京交通职业技术学院','北京科技大学天津学院','北京科技职业学院','北京理工大学珠海学院','北京培黎职业学院','北京现代职业技术学院','北京邮电大学世纪学院','北京中医药大学东方学院','长春理工大学光电信息学院','长江大学','长江大学工程技术学院','长江工程职业技术学院','长沙理工大学','长沙理工大学城南学院','长沙学院','长沙医学院','成都东软学院','成都理工大学广播影视学院','大连交通大学','大连科技学院','电子科技大学成都学院','东北财经大学津桥商学院','东北农业大学成栋学院','鄂东职业技术学院','广东金融学院','广西财经学院','广西经贸职业技术学院','广州南洋理工职业学院','桂林电子科技大学信息科技学院','黑龙江外国语学院','杭州电子科技大学','河北大学工商学院','河北工程大学','河北联合大学轻工学院','河北传媒学院','河南大学民生学院','河南工业大学','河南科技学院新科学院','河南理工大学','哈尔滨江南职业技术学院','黑龙江三江美术职业学院','红河学院','湖北国土资源职业学院','湖北三峡职业技术学院','湖北职业技术学院','湖南工业大学','湖南工业大学科技学院','湖南科技大学','湖南科技大学潇湘学院','湖南涉外经济学院','华北电力大学科技学院','河北联合大学冀唐学院','华北水利水电学院','华南师范大学增城学院','华中科技大学文华学院','黄淮学院','吉林大学珠海学院','长春建筑学院','吉林农业大学发展学院','集美大学诚毅学院','江苏大学京江学院','江苏科技大学','江苏科技大学南徐学院','江西财经大学现代经济管理学院','江西大宇职业技术学院','江西服装学院','南昌工学院','江西工业贸易职业技术学院','江西建设职业技术学院','江西理工大学','江西理工大学应用科学学院','江西外语外贸职业学院','江西中医学院科技学院','金陵科技学院','井冈山大学','景德镇陶瓷学院科技艺术学院','昆明医学院海源学院','兰州交通大学','辽宁对外经贸学院','辽宁科技学院','辽宁石油化工大学顺华能源学院','内蒙古科技大学','南昌大学共青学院','南昌大学科学技术学院','南昌工程学院','南昌航空大学科技学院','南昌理工学院','南充职业技术学院','南华大学船山学院','南京财经大学','南京工业大学浦江学院','南京航空航天大学金城学院','南京审计学院金审学院','南京师范大学泰州学院','南京信息工程大学','南京信息工程大学滨江学院','南京邮电大学','南京邮电大学通达学院','南开大学滨海学院','南通大学','青岛港湾职业技术学院','青岛恒星职业技术学院','青岛理工大学','三亚航空旅游职业学院','山西财经大学华商学院','山西旅游职业学院','陕西电子信息职业技术学院','上海电影艺术职业学院','上海工商外国语职业学院','上海海事大学','上海商学院','上海托普信息技术职业学院','沈阳大学科技工程学院','沈阳工程学院','沈阳建筑大学','沈阳理工大学','石家庄经济学院华信学院','石家庄铁道大学四方学院','石家庄外语翻译职业学院','石家庄医学高等专科学校','石家庄邮电职业技术学院','首都师范大学科德学院','四川航天职业技术学院','四川外语学院重庆南方翻译学院','苏州经贸职业技术学院','太原科技大学','太原理工大学现代科技学院','天津财经大学','天津职业技术师范大学','天津石油职业技术学院','天津医科大学临床医学院','武汉交通职业学院','武汉理工大学华夏学院','武汉民政职业学院','武汉铁路职业技术学院','西安财经学院行知学院','西安海棠职业学院','西安科技大学','西安培华学院','西安石油大学','西安文理学院','西北工业大学明德学院','西北民族大学','西华师范大学','西南民族大学','厦门大学嘉庚学院','厦门演艺职业学院','香港城市大学','香港中文大学','云南大学旅游文化学院','云南科技信息职业学院','云南师范大学商学院','云南师范大学文理学院','浙江传媒学院','浙江工商大学','郑州升达经贸管理学院','郑州经贸职业学院','中北大学','太原工业学院','中北大学信息商务学院','中国传媒大学南广学院','中国地质大学长城学院','中国地质大学江城学院','中国环境管理干部学院','中国矿业大学徐海学院','中国劳动关系学院','中国医科大学临床医药学院','武汉长江工商学院','重庆工商大学','重庆工商大学派斯学院','重庆工商大学融智学院','重庆科技学院','重庆师范大学','重庆文理学院','武警福州指挥学院','云南民族大学','湖北工业大学','云南警官学院','西华大学','厦门理工学院','长春中医药大学','云南财经大学','新疆财经大学','宁波诺丁汉大学','香港科技大学','香港大学','香港理工大学','香港浸会大学','香港岭南大学','香港教育学院','西交利物浦大学','梧州学院','山西大同大学','河北北方学院','衡水学院','河南科技学院','吉林农业科技学院','鲁东大学','湖南人文科技学院','滨州学院','河北联合大学','安徽科技学院','安徽农业大学经济技术学院','上海济光职业技术学院','延安大学西安创新学院','江苏海事职业技术学院','河北农业大学现代科技学院','海南经贸职业技术学院','大连软件职业学院','天津海运职业学院','山东经济学院燕山学院','济南工程职业技术学院','江西科技师范学院理工学院','贵州大学科技学院','安徽建筑工业学院城市建设学院','贵阳医学院神奇民族医药学院','安阳工学院','昆明理工大学津桥学院','西北师范大学知行学院','河北科技大学理工学院','天津大学仁爱学院','中南林业科技大学涉外学院','武汉生物工程学院','吉林建筑工程学院城建学院','四川外语学院成都学院','阜阳科技职业学院','泉州纺织服装职业学院','广西民族大学相思湖学院','河北工业大学城市学院','天津铁道职业技术学院','渤海大学文理学院','中国计量学院现代科技学院','山东财政学院东方学院','四川师范大学文理学院','江西先锋软件职业技术学院','常德职业技术学院','湖北汽车工业学院科技学院','天津城市建设管理职业技术学院','马鞍山师范高等专科学校','西安翻译学院','陕西青年职业学院','沈阳农业大学科学技术学院','云南大学滇池学院','天津师范大学津沽学院','大连枫叶职业技术学院','黄石理工学院','河北软件职业技术学院','湖南农业大学东方科技学院','永城职业学院','海南政法职业学院','西京学院','安徽财经大学商学院','河北医科大学临床学院','广西大学行健文理学院','沈阳理工大学应用技术学院','重庆邮电大学移通学院','唐山科技职业技术学院','中南财经政法大学武汉学院','福建师范大学协和学院','武汉工程大学邮电与信息工程学院','成都信息工程学院银杏酒店管理学院','哈尔滨商业大学广厦学院','太原科技大学华科学院','渤海大学','厦门华天涉外职业技术学院','石家庄科技信息职业学院','天津冶金职业技术学院','白城医学高等专科学校','天津体育学院运动与文化艺术学院','武汉工业学院工商学院','福建对外经济贸易职业技术学院','长春大学光华学院','淮北师范大学信息学院','长春工业大学人文信息学院','河北工程大学科信学院','宁夏大学新华学院','燕山大学里仁学院','西安建筑科技大学华清学院','山西电力职业技术学院','哈尔滨理工大学远东学院','中原工学院信息商务学院','沧州医学高等专科学校','湖南商学院北津学院','江西农业大学南昌商学院','兰州商学院陇桥学院','武汉科技大学城市学院','辽宁中医药大学杏林学院','江西师范大学科学技术学院','湖南司法警官职业学院','商洛学院','天津城市职业学院','抚州职业技术学院','湖南工程学院应用技术学院','烟台大学文经学院','岳阳职业技术学院','长江大学文理学院','山东医学高等专科学校','河南检察职业学院','广西中医学院赛恩斯新医药学院','湖北大学知行学院','贵州大学明德学院','湖北工业大学商贸学院','华东交通大学理工学院','贵阳中医学院时珍学院','青岛求实职业技术学院','西安工业大学北方信息工程学院','新疆医科大学厚博学院','河北师范大学汇华学院','江苏经贸职业技术学院','郑州职业技术学院','山东药品食品职业学院','天津外国语大学滨海外事学院','贵州师范大学求是学院','天津生物工程职业技术学院','河北经贸大学经济管理学院','山西师范大学现代文理学院','三峡大学科技学院','安徽大学江淮学院','吉首大学张家界学院','安顺学院','辽宁何氏医学院','天津理工大学中环信息学院','贵州财经学院商务学院','上海思博职业技术学院','陕西邮电职业技术学院','哈尔滨华德学院','济南大学泉城学院','凯里学院','新乡医学院三全学院','石家庄外国语职业学院','海南外国语职业学院','陕西警官职业学院','江汉大学文理学院','渤海石油职业学院','山东旅游职业学院','广西工学院鹿山学院','陕西科技大学镐京学院','东北师范大学人文学院','江西制造职业技术学院','沈阳工业大学工程学院','湖北医药学院药护学院','山西医科大学晋祠学院','四川警安职业学院','青海大学昆仑学院','兰州商学院长青学院','湖北师范学院文理学院','西安铁路职业技术学院','解放军军事经济学院','解放军南京政治学院','中国人民解放军第三军医大学','南方医科大学','中国人民解放军工程兵指挥学院','中国人民解放军军事交通学院','上海金融学院','上海立信会计学院','上海电机学院','石家庄学院','邯郸学院','河北金融学院','菏泽学院','山东警察学院','济宁学院','长治学院','滁州学院','宿州学院','东华理工大学','丽水学院','湖南工学院','湘南学院','贺州学院','钦州学院','铜仁学院','西昌学院','榆林学院','西安医学院','西北政法大学','安康学院','宁夏师范学院','吉林工商学院','赤峰学院','琼州学院','三明学院','龙岩学院','陇东学院','澳门科技大学','澳门旅游学院','天津广播影视职业学院','河北劳动关系职业学院','泊头职业学院','宣化科技职业学院','山西轻工职业技术学院','乌兰察布医学高等专科学校','鄂尔多斯职业学院','辽宁现代服务职业技术学院','四平职业大学','杭州科技职业技术学院','黎明职业大学','江西冶金职业技术学院','江西新闻出版职业技术学院','郑州理工职业学院','山东理工职业学院','山东文化产业职业学院','安阳职业技术学院','新乡职业技术学院','驻马店职业技术学院','三峡旅游职业技术学院','湖南生物机电职业技术学院','广州番禺职业技术学院','广西幼儿师范高等专科学校','重庆航天职业技术学院','重庆商务职业学院','四川文化产业职业学院','四川幼儿师范高等专科学校','廊坊东方职业技术学院','石家庄人民医学高等专科学校','石家庄科技职业学院','石家庄理工职业学院','运城职业技术学院','大连东软信息学院','辽宁财贸学院','大连艺术学院','大连航运职业技术学院','大连装备制造职业技术学院','大连汽车职业技术学院','哈尔滨德强商务学院','苏州信息职业技术学院','浙江横店影视职业学院','浙江汽车职业技术学院','安徽矿业职业技术学院','合肥信息技术职业学院','民办合肥滨湖职业技术学院','安徽现代信息工程职业学院','泉州泰山航海职业学院','泉州轻工职业学院','厦门安防科技职业学院','江西太阳能科技职业学院','漯河食品职业学院','郑州城市职业学院（原郑州布瑞达理工职业学院）','广西经济职业学院','三亚理工职业学院','重庆传媒职业学院','重庆能源职业学院','西安医学高等专科学校','北京第二外国语学院中瑞酒店管理学院','常州大学怀德学院','上海财经大学浙江学院','西南交通大学希望学院','东莞职业技术学院','山东女子学院','浙江外国语学院','北京交通运输职业学院','北京新圆明职业学院','北京体育职业学院','承德护理职业学院','廊坊燕京职业技术学院','阳泉师范高等专科学校','辽宁卫生职业技术学院','吉林科技职业技术学院','宿迁泽达职业技术学院','桐城师范高等专科学校','安徽汽车职业技术学院','皖西卫生职业学院','滁州城市职业学院','青岛远洋船员职业学院','焦作工贸职业学院','河南化工职业学院','河南艺术职业学院','许昌陶瓷职业学院','辽宁理工职业学院','晋中师范高等专科学校','内蒙古轩元职业学院','呼伦贝尔职业技术学院','满洲里俄语职业学院','辽宁冶金职业技术学院','辽宁工程职业学院','辽宁城市建设职业技术学院','铁岭卫生职业学院','黑龙江护理高等专科学校','黑龙江农垦科技职业学院','苏州工业园区服务外包职业学院','郑州信息工程职业学院','长垣烹饪职业技术学院','武汉城市职业学院','湖南高尔夫旅游职业学院','湖南工商职业学院','广州华商职业学院','广东江门艺华旅游职业学院','广州华夏职业学院','广东环境保护工程职业学院','广西科技职业学院','广西卫生职业技术学院','海南工商职业学院','重庆房地产职业学院','重庆电讯职业学院','重庆化工职业学院','重庆交通职业学院','重庆旅游职业学院','陕西工商职业学院','榆林职业技术学院','开封教育学院','廊坊卫生职业学院','内蒙古能源职业学院','赤峰工业职业技术学院','阿拉善职业技术学院','浙江农业商贸职业学院','安徽扬子职业技术学院','安徽黄梅戏艺术职业学院','江西工商职业技术学院','济南护理职业学院','泰山护理职业学院','山东海事职业学院','潍坊护理职业学院','河南机电职业学院','河南护理职业学院','河南推拿职业学院','许昌电气职业学院','信阳涉外职业技术学院','鹤壁汽车工程职业学院','南阳职业学院','郑州商贸旅游职业学院','天门职业学院','湖北体育职业学院','襄阳汽车职业技术学院','长沙卫生职业学院','湖南食品药品职业学院','湖南三一工业职业技术学院','广州东华职业学院','广东创新科技职业学院','重庆安全技术职业学院','重庆公共运输职业学院','重庆艺术工程职业学院','重庆轻工职业学院','重庆电信职业学院','重庆经贸职业学院','四川长江职业学院','贵州盛华职业学院','云南骨伤科中等专业学校','云南现代职业技术学院','云南旅游学校','宁夏防沙治沙职业技术学院','昆明学院','保山学院','济南幼儿师范高等专科学校','黔南民族医学高等专科学校','贵州商业高等专科学校','石河子大学科技学院','长安大学兴华学院','同济大学同科学院','中国人民解放军陆军航空兵学院','中国人民解放军军械工程学院','中国人民解放军海军大连舰艇学院','大连东软信息技术职业学院','遵义职业技术学院','六盘水职业技术学院','延边职业技术学院','安徽长江职业学院','福建教育学院','洛阳职业技术学院','第一拖拉机制造厂拖拉机学院','荆州教育学院','株洲市职工大学','贵州师范学院','陕西省建筑职工大学','兰州航空工业职工大学','甘肃有色冶金职业技术学院','南京人口管理干部学院','河南卫生职工学院','广东青年职业学院','赣南教育学院','湖南有色金属职业技术学院','贵州职业技术学院','贵阳职业技术学院','西藏警官高等专科学校','复旦大学上海视觉艺术学院','北京科技大学延庆分校','张家口教育学院','山东省聊城教育学院','武警石家庄指挥学院','琼台师范高等专科学校','沈阳化工大学科亚学院','西安电子科技大学长安学院','中国人民解放军海军航空工程学院','毕节学院','贵阳学院','武警哈尔滨指挥学院','贵州工业职业技术学院','德宏职业学院','云南三鑫职业技术学院','云南经贸外事职业学院','北京交通大学海滨学院','内蒙古师范大学鸿德学院','内蒙古大学创业学院','沈阳航空航天大学北方科技学院','吉林财经大学信息经济学院','同济大学浙江学院','河海大学文天学院','华侨大学厦门工学院','武汉纺织大学外经贸学院','桂林理工大学博文管理学院','中国矿业大学银川学院','石家庄幼儿师范高等专科学校','徐州幼儿师范高等专科学校','合肥幼儿师范高等专科学校','黄山职业技术学院','泉州幼儿师范高等专科学校','云南商务职业学院','北京电影学院现代创意媒体学院'];
var speciality = ['文科试验班类','社会科学试验班','人文科学试验班','理科试验班类','理科试验班','医学试验班类','医学试验班','哲学类','哲学基地班','哲学','逻辑学','宗教学','伦理学','经济学类','经济学基地班','经济学','国际经济与贸易','财政学','金融学','国民经济管理','贸易经济','保险','环境经济','金融工程','税务','信用管理','网络经济学','体育经济','投资学','环境资源与发展经济学','海洋经济学','国际文化贸易','经济学类(中外合作办学)','法学类','法学','知识产权法','知识产权','监狱学','法学类(中外合作办学)','科学社会主义与国际共产主义运动','中国革命史与中国共产党党史','社会学类','社会学','社会工作','家政学','人类学','女性学','社会学类(中外合作办学)','政治学类','政治学与行政学','国际政治','外交学','思想政治教育','国际文化交流','国际事务','国际事务与国际关系','政治学类(中外合作办学)','公安学类','治安学','侦查学','边防管理','火灾勘查','禁毒学','警犬技术','经济犯罪侦查','边防指挥','消防指挥','公安情报学','犯罪学','公安管理学','教育学类','教育学','学前教育','特殊教育','教育技术学','小学教育','艺术教育','人文教育','科学教育','言语听觉科学','体育学类','体育教育','社会体育','运动人体科学','民族传统体育','运动康复与健康','职业技术教育类','农艺教育','园艺教育','水产养殖教育','应用生物教育','机械制造工艺教育','机电技术教育','电气技术教育','汽车维修工程教育','应用电子技术教育','食品工艺教育','建筑工程教育','服装设计与工艺教育','旅游管理与服务教育','食品营养与检验教育','烹饪与营养教育','财务会计教育','文秘教育','市场营销教育','职业技术教育管理','中国语言文学类','中国语言文学基地班','汉语言文学','汉语言','对外汉语','中国少数民族语言文学','古典文献','应用语言学','中国语言文学类(中外合作办学)','外国语言文学类','英语','俄语','德语','法语','西班牙语','阿拉伯语','日语','波斯语','朝鲜语','菲律宾语','梵语巴利语','印度尼西亚语','印地语','柬埔寨语','老挝语','缅甸语','马来语','蒙古语','僧加罗语','泰语','乌尔都语','希伯莱语','越南语','豪萨语','斯瓦希里语','阿尔巴尼亚语','保加利亚语','波兰语','捷克语','罗马尼亚语','葡萄牙语','瑞典语','塞尔维亚—克罗地亚语','土耳其语','希腊语','匈牙利语','意大利语','捷克语-斯洛伐克语','泰米尔语','普什图语','世界语','孟加拉语','尼伯尔语','塞尔维亚语-克罗地亚语','荷兰语','芬兰语','韩国语','翻译','外国语言文学类(中外合作办学)','新闻传播学类','新闻学','广播电视新闻学','广告学','编辑出版学','传播学','媒体创意','新闻传播学类(中外合作办学)','艺术类','音乐学','作曲与作曲技术理论','音乐表演','绘画','雕塑','美术学','艺术设计学','艺术设计','舞蹈学','舞蹈编导','戏剧学','表演','导演','戏剧影视文学','戏剧影视美术设计','摄影','录音艺术','动画','播音与主持艺术','广播电视编导','历史学类','历史学基地班','历史学','世界历史','考古学','博物馆学','民族学','文物保护技术','数学类','数学基地班','数学与应用数学','信息与计算科学','数理基础科学','数学类(中外合作办学)','物理学类','物理学基地班','物理学','应用物理学','声学','化学类','化学基地班','化学','应用化学','化学生物学','分子科学与工程','化学类(中外合作办学)','生物科学类','生物学基地班','生物科学','生物技术','生物信息学','生物信息技术','生物科学与生物技术','动植物检疫','生物化学与分子生物学','医学信息学','生命科学与技术基地班','动物生物技术','生物资源科学','生物安全','生物科学类(中外合作办学)','天文学','地质学类','地质学基地班','地质学','地球化学','地理科学类','地理学基地班','地理科学','资源环境与城乡规划管理','地理信息系统','地球信息科学与技术','地理科学类(中外合作办学)','地球物理学类','地球物理学','地球与空间科学','空间科学与技术','大气科学类','大气科学基地班','大气科学','应用气象学','海洋科学类','海洋科学','海洋技术','海洋管理','军事海洋学','海洋生物资源与环境','力学类','力学基地班','理论与应用力学','电子信息科学类','电子信息科学与技术','微电子学','光信息科学与技术','科技防卫','信息安全','信息科学技术','光电子技术科学','电子信息科学类(中外合作办学)','材料科学类','材料物理','材料化学','材料科学类(中外合作办学)','环境科学类','环境科学','生态学','资源环境科学','环境科学类(中外合作办学)','心理学类','心理学','应用心理学','统计学类','统计学','统计学类(中外合作办学)','系统科学类','系统理论','系统科学与工程','地矿类','采矿工程','石油工程','矿物加工工程','勘查技术与工程','资源勘查工程','地质工程','矿物资源工程','煤及煤层气工程','材料类','冶金工程','金属材料工程','无机非金属材料工程','高分子材料与工程','材料科学与工程','复合材料与工程','焊接技术与工程','宝石及材料工艺学','粉体材料科学与工程','再生资源科学与技术','稀土工程','高分子材料加工工程','生物功能材料','材料类(中外合作办学)','机械类','机械设计制造及其自动化','材料成型及控制工程','工业设计','过程装备与控制工程','机械工程及自动化','车辆工程','机械电子工程','汽车服务工程','制造自动化与测控技术','制造工程','体育装备工程','机械类(中外合作办学)','仪器仪表类','测控技术与仪器','电子信息技术及仪器','仪器仪表类(中外合作办学)','能源动力类','热能与动力工程','核工程与核技术','工程物理','能源与环境系统工程','能源工程及自动化','能源动力系统及自动化','风能与动力工程','核技术','辐射防护与环境工程','电气信息类','电气工程及其自动化','自动化','电子信息工程','通信工程','计算机科学与技术','电子科学与技术','生物医学工程','电气工程与自动化','信息工程','软件工程','影视艺术技术','网络工程','信息显示与光电技术','集成电路设计与集成系统','光电信息工程','广播电视工程','电气信息工程','计算机软件','电力工程与管理','微电子制造工程','数字媒体艺术','医学信息工程','信息物理工程','医疗器械工程','智能科学与技术','数字媒体技术','医学影像工程','真空电子技术','电磁学与无线技术','电信工程及管理','电气信息类(中外合作办学)','土建类','建筑学','城市规划','土木工程','建筑环境与设备工程','给水排水工程','城市地下空间工程','历史建筑保护工程','景观建筑设计','水务工程','建筑设施智能技术','给排水科学与工程','建筑电气与智能化','景观学','道路桥梁与渡河工程','土建类(中外合作办学)','水利类','水利水电工程','水文与水资源工程','港口航道与海岸工程','水资源与海洋工程','测绘类','测绘工程','遥感科学与技术','空间信息与数字技术','测绘类(中外合作办学)','环境与安全类','环境工程','安全工程','水质科学与技术','灾害防治工程','环境科学与工程','环境监察','雷电防护科学与技术','环境与安全类(中外合作办学)','化工与制药类','化学工程与工艺','制药工程','化工与制药','化学工程与工业生物工程','资源科学与工程','交通运输类','交通运输','交通工程','油气储运工程','飞行技术','航海技术','轮机工程','物流工程','海事管理','交通设备信息工程','交通运输类(中外合作办学)','海洋工程类','船舶与海洋工程','海洋工程类(中外合作办学)','轻工纺织食品类','食品科学与工程','轻化工程','包装工程','印刷工程','纺织工程','服装设计与工程','食品质量与安全','酿酒工程','葡萄与葡萄酒工程','轻工生物技术','农产品质量与安全','非织造材料与工程','数字印刷','植物资源工程','粮食工程','轻工纺织食品类(中外合作办学)','航空航天类','飞行器设计与工程','飞行器动力工程','飞行器制造工程','飞行器环境与生命保障工程','工程力学与航天航空工程','航天运输与控制','质量与可靠性工程','武器类','武器系统与发射工程','探测制导与控制技术','弹药工程与爆炸技术','特种能源工程与烟火技术','地面武器机动工程','信息对抗技术','工程力学类','工程力学','工程结构分析','生物工程类','生物工程','生物工程类(中外合作办学)','农业工程类','农业机械化及其自动化','农业电气化与自动化','农业建筑环境与能源工程','农业水利工程','农业工程','生物系统工程','森林工程','木材科学与工程','林产化工','刑事科学技术','消防工程','安全防范工程','交通管理工程','核生化消防','公安视听技术','植物生产类','农学','园艺','植物保护','茶学','烟草','植物科学与技术','种子科学与工程','应用生物科学','设施农业科学与工程','植物生产类(中外合作办学)','草业科学类','草业科学','草业科学类(中外合作办学)','森林资源类','林学','森林资源保护与游憩','野生动物与自然保护区管理','森林资源类(中外合作办学)','环境生态类','园林','水土保持与荒漠化防治','农业资源与环境','环境生态类(中外合作办学)','动物生产类','动物科学','蚕学','蜂学','动物生产类(中外合作办学)','动物医学类','动物医学','动物药学','动物医学类(中外合作办学)','水产养殖学','海洋渔业科学与技术','水族科学与技术','基础医学类','基础医学基地班','基础医学','预防医学类','预防医学','卫生检验','妇幼保健医学','营养学','临床医学与医学技术类','临床医学','麻醉学','医学影像学','医学检验','放射医学','眼视光学','康复治疗学','精神医学','医学技术','听力学','医学实验学','医学美容技术','临床医学与医学技术类(中外合作办学)','口腔医学类','口腔医学','口腔修复工艺学','口腔医学类(中外合作办学)','中医学类','中医基础学基地班','中医学','针灸推拿学','蒙医学','藏医学','中西医临床医学','维医学','中医学类(中外合作办学)','法医学','护理学类','护理学','护理学类(中外合作办学)','药学类','基础药学基地班','药学','中药学','药物制剂','中草药栽培与鉴定','藏药学','中药资源与开发','应用药学','海洋药学','药事管理','蒙药学','药学类(中外合作办学)','管理科学与工程类','管理科学','信息管理与信息系统','工业工程','工程管理','工程造价','房地产经营管理','产品质量工程','项目管理','管理科学工程','管理科学与工程类(中外合作办学)','工商管理类','工商管理','市场营销','会计学','财务管理','人力资源管理','旅游管理','商品学','审计学','电子商务','物流管理','国际商务','物业管理','特许经营管理','连锁经营管理','资产评估','电子商务及法律','商务策划管理','工商管理类(中外合作办学)','公共管理类','行政管理','公共事业管理','劳动与社会保障','土地资源管理','公共关系学','高等教育管理','公共政策学','城市管理','公共管理','文化产业管理','会展经济与管理','国防教育与管理','航运管理','劳动关系','公共安全管理','体育产业管理','公共管理类(中外合作办学)','农业经济管理类','农林经济管理','农村区域发展','农业经济管理类(中外合作办学)','图书档案学类','图书馆学','档案学','信息资源管理','政治经济学','政治学','国际关系与安全','军事外交','中国语言文学','外国语言文学(外国军事)','军事历史','应用数学','军事气象学','军事海洋学','军事心理学','军用材料工程','机械装备类','车辆运用工程','油料储运工程','舰船动力工程','核动力工程','电力工程及其自动化','电子工程','雷达工程','导航工程','军用光电工程','航空反潜工程','侦测工程','信息研究与安全(密码学)','密码装备工程','仿真工程','指挥自动化工程','国防建筑学','土木工程(机场工程)','野战给水工程','国防建筑设备工程','道路桥梁与渡河濒海工程','测量工程','地图学与地理信息工程','工程物理','生化防护工程','国防工程与防护','伪装工程','舰船与海洋工程','飞行器系统与工程','空间工程','兵器工程','导弹工程','弹药工程','地雷爆破与破障工程','火力指挥与控制工程','测控工程','无人机运用工程','探测工程','管理工程','系统工程','经济管理类','军队财务管理','装备经济管理','军队审计','军队采办','炮兵指挥','防空兵指挥','工程兵指挥','防化兵指挥','航空航天指挥类','航空飞行与指挥','侦察与特种兵指挥','通信指挥','电子对抗指挥与工程','军事情报','作战信息管理','预警探测指挥','军事交通指挥与工程','汽车指挥','船艇指挥','航空兵场站指挥','装备保障指挥','军需勤务指挥','武警指挥类','武警指挥'];
var category1 = ['实验班','哲学','经济学','法学','教育学','文学','历史学','理学','工学','农学','医学','管理学','军事学'];
var category2 = {
	1:['文科试验班类','理科试验班类','医学试验班类'],
	2:['哲学类'],
	3:['经济学类'],
	4:['法学类','社会学类','政治学类','公安学类'],
	5:['教育学类','体育学类','职业技术教育类'],
	6:['中国语言文学类','外国语言文学类','新闻传播学类'],
	7:['历史学类'],
	8:['数学类','物理学类','化学类','生物科学类','地质学类','地理科学类','地球物理学类','大气科学类','海洋科学类','力学类','电子信息科学类','材料科学类','环境科学类','统计学类','系统科学类','心理学类'],
	9:['地矿类','材料类','机械类','仪器仪表类','能源动力类','电气信息类','土建类','化工与制药类','交通运输类','海洋工程类','轻工纺织食品类','航空航天类','武器类','工程力学类','生物工程类','农业工程类','水利类','测绘类','环境与安全类'],
	10:['植物生产类','草业科学类','森林资源类','环境生态类','动物生产类','动物医学类'],
	11:['基础医学类','预防医学类','临床医学与医学技术类','口腔医学类','中医学类','护理学类','药学类'],
	12:['管理科学与工程类','工商管理类','公共管理类','农业经济管理类','图书档案学类'],
	13:['航空航天指挥类','武警指挥类']
};

var school_option_key = new Array();

school_option_key[0] = Array();
school_option_key[1] = Array();
school_option_key[2] = Array();
school_option_key[3] = Array();
school_option_key[4] = Array();
school_option_key[5] = Array();
school_option_key[6] = Array();
school_option_key[7] = Array();
school_option_key[8] = Array();
school_option_key[9] = Array();
school_option_key[10] = Array();
school_option_key[11] = Array();
school_option_key[12] = Array();
school_option_key[13] = Array();
school_option_key[14] = Array();
school_option_key[15] = Array();
school_option_key[16] = Array();
school_option_key[17] = Array();
school_option_key[18] = Array();
school_option_key[19] = Array();
school_option_key[20] = Array();
school_option_key[21] = Array();
school_option_key[22] = Array();
school_option_key[23] = Array();
school_option_key[24] = Array();
school_option_key[25] = Array();
school_option_key[26] = Array();
school_option_key[27] = Array();
school_option_key[28] = Array();
school_option_key[29] = Array();
school_option_key[30] = Array();
school_option_key[31] = Array();
school_option_key[32] = Array();

school_option_key[1]['10001'] = '北京大学';
school_option_key[1]['10002'] = '中国人民大学';
school_option_key[1]['10003'] = '清华大学';
school_option_key[1]['10004'] = '北京交通大学';
school_option_key[1]['10005'] = '北京工业大学';
school_option_key[1]['10006'] = '北京航空航天大学';
school_option_key[1]['10007'] = '北京理工大学';
school_option_key[1]['10008'] = '北京科技大学';
school_option_key[1]['10010'] = '北京化工大学';
school_option_key[1]['10013'] = '北京邮电大学';
school_option_key[1]['10019'] = '中国农业大学';
school_option_key[1]['10022'] = '北京林业大学';
school_option_key[1]['10023'] = '北京协和医学院';
school_option_key[1]['10026'] = '北京中医药大学';
school_option_key[1]['10027'] = '北京师范大学';
school_option_key[1]['10030'] = '北京外国语大学';
school_option_key[1]['10034'] = '中央财经大学';
school_option_key[1]['10036'] = '对外经济贸易大学';
school_option_key[1]['10043'] = '北京体育大学';
school_option_key[1]['10045'] = '中央音乐学院';
school_option_key[1]['10052'] = '中央民族大学';
school_option_key[1]['10053'] = '中国政法大学';
school_option_key[1]['10054'] = '华北电力大学';
school_option_key[1]['11413'] = '中国矿业大学(北京)';
school_option_key[1]['11415'] = '中国地质大学(北京)';
school_option_key[1]['50203'] = '中国传媒大学';
school_option_key[1]['50212'] = '中国石油大学(北京)';
school_option_key[1]['10009'] = '北方工业大学';
school_option_key[1]['10012'] = '北京服装学院';
school_option_key[1]['10015'] = '北京印刷学院';
school_option_key[1]['10016'] = '北京建筑工程学院';
school_option_key[1]['10017'] = '北京石油化工学院';
school_option_key[1]['10018'] = '北京电子科技学院';
school_option_key[1]['10020'] = '北京农学院';
school_option_key[1]['10025'] = '首都医科大学';
school_option_key[1]['10028'] = '首都师范大学';
school_option_key[1]['10029'] = '首都体育学院';
school_option_key[1]['10031'] = '北京第二外国语学院';
school_option_key[1]['10032'] = '北京语言大学';
school_option_key[1]['10037'] = '北京物资学院';
school_option_key[1]['10040'] = '外交学院';
school_option_key[1]['10041'] = '中国人民公安大学';
school_option_key[1]['10042'] = '国际关系学院';
school_option_key[1]['10046'] = '中国音乐学院';
school_option_key[1]['10047'] = '中央美术学院';
school_option_key[1]['10048'] = '中央戏剧学院';
school_option_key[1]['10049'] = '中国戏曲学院';
school_option_key[1]['10050'] = '北京电影学院';
school_option_key[1]['10051'] = '北京舞蹈学院';
school_option_key[1]['10772'] = '北京信息科技大学';
school_option_key[1]['11104'] = '华北科技学院';
school_option_key[1]['11232'] = '北京机械工业学院';
school_option_key[1]['11417'] = '北京联合大学';
school_option_key[1]['11625'] = '中国青年政治学院';
school_option_key[1]['11626'] = '北京青年政治学院';
school_option_key[1]['11775'] = '防灾科技学院';
school_option_key[1]['11831'] = '首钢工学院';
school_option_key[1]['11912'] = '首都经济贸易大学';
school_option_key[1]['11921'] = '北京工商大学';
school_option_key[1]['11954'] = '中华女子学院';
school_option_key[1]['50007'] = '北京大学医学部';
school_option_key[1]['50009'] = '北京工业大学(实验学院)';
school_option_key[1]['50162'] = '首都师范大学科德学院';
school_option_key[1]['50211'] = '中国劳动关系学院';
school_option_key[2]['10055'] = '南开大学';
school_option_key[2]['10056'] = '天津大学';
school_option_key[2]['10080'] = '河北工业大学';
school_option_key[2]['11904'] = '天津医科大学';
school_option_key[2]['10057'] = '天津科技大学';
school_option_key[2]['10058'] = '天津工业大学';
school_option_key[2]['10059'] = '中国民航大学';
school_option_key[2]['10060'] = '天津理工大学';
school_option_key[2]['10061'] = '天津农学院';
school_option_key[2]['10063'] = '天津中医药大学';
school_option_key[2]['10065'] = '天津师范大学';
school_option_key[2]['10068'] = '天津外国语学院';
school_option_key[2]['10069'] = '天津商业大学';
school_option_key[2]['10071'] = '天津体育学院';
school_option_key[2]['10072'] = '天津音乐学院';
school_option_key[2]['10073'] = '天津美术学院';
school_option_key[2]['10792'] = '天津城市建设学院';
school_option_key[2]['50168'] = '天津财经大学';
school_option_key[2]['50169'] = '天津工程师范学院';
school_option_key[2]['80024'] = '中国人民解放军军事交通学院';
school_option_key[3]['10246'] = '复旦大学';
school_option_key[3]['10247'] = '同济大学';
school_option_key[3]['10248'] = '上海交通大学';
school_option_key[3]['10251'] = '华东理工大学';
school_option_key[3]['10255'] = '东华大学';
school_option_key[3]['10268'] = '上海中医药大学';
school_option_key[3]['10269'] = '华东师范大学';
school_option_key[3]['10271'] = '上海外国语大学';
school_option_key[3]['10272'] = '上海财经大学';
school_option_key[3]['11903'] = '上海大学';
school_option_key[3]['20034'] = '第二军医大学';
school_option_key[3]['50149'] = '上海交通大学医学院';
school_option_key[3]['10252'] = '上海理工大学';
school_option_key[3]['10256'] = '上海电力学院';
school_option_key[3]['10264'] = '上海水产大学';
school_option_key[3]['10270'] = '上海师范大学';
school_option_key[3]['10273'] = '上海对外贸易学院';
school_option_key[3]['10276'] = '华东政法大学';
school_option_key[3]['10277'] = '上海体育学院';
school_option_key[3]['10278'] = '上海音乐学院';
school_option_key[3]['10279'] = '上海戏剧学院';
school_option_key[3]['10856'] = '上海工程技术大学';
school_option_key[3]['11835'] = '上海政法学院';
school_option_key[3]['23105'] = '上海第二工业大学';
school_option_key[3]['31252'] = '上海市广播电视大学';
school_option_key[3]['50148'] = '上海海事大学';
school_option_key[3]['50150'] = '上海商学院';
school_option_key[3]['90105'] = '上海金融学院';
school_option_key[4]['10611'] = '重庆大学';
school_option_key[4]['10635'] = '西南大学';
school_option_key[4]['10617'] = '重庆邮电大学';
school_option_key[4]['10618'] = '重庆交通大学';
school_option_key[4]['10625'] = '西南农业大学';
school_option_key[4]['10631'] = '重庆医科大学';
school_option_key[4]['10643'] = '重庆三峡学院';
school_option_key[4]['10647'] = '长江师范学院';
school_option_key[4]['10650'] = '四川外语学院';
school_option_key[4]['10652'] = '西南政法大学';
school_option_key[4]['10655'] = '四川美术学院';
school_option_key[4]['11660'] = '重庆理工大学(原重庆工学院)';
school_option_key[4]['11916'] = '重庆电力高等专科学校';
school_option_key[4]['13589'] = '重庆师范大学涉外商贸学院';
school_option_key[4]['50216'] = '重庆工商大学';
school_option_key[4]['50219'] = '重庆科技学院';
school_option_key[4]['50221'] = '重庆师范大学';
school_option_key[4]['50222'] = '重庆文理学院';
school_option_key[5]['10079'] = '华北电力大学(保定)';
school_option_key[5]['19145'] = '东北大学秦皇岛分校';
school_option_key[5]['10075'] = '河北大学';
school_option_key[5]['10077'] = '石家庄经济学院';
school_option_key[5]['10082'] = '河北科技大学';
school_option_key[5]['10084'] = '河北建筑工程学院';
school_option_key[5]['10090'] = '华北煤炭医学院';
school_option_key[5]['10093'] = '承德医学院';
school_option_key[5]['10094'] = '河北师范大学';
school_option_key[5]['10099'] = '唐山师范学院';
school_option_key[5]['10100'] = '廊坊师范学院';
school_option_key[5]['10104'] = '邢台学院';
school_option_key[5]['10107'] = '石家庄铁道学院';
school_option_key[5]['10216'] = '燕山大学';
school_option_key[5]['10798'] = '河北科技师范学院';
school_option_key[5]['11105'] = '中国人民武装警察部队学院';
school_option_key[5]['11236'] = '河北体育学院';
school_option_key[5]['11918'] = '河北经贸大学';
school_option_key[5]['11919'] = '河北医科大学';
school_option_key[5]['11920'] = '河北农业大学';
school_option_key[5]['11960'] = '唐山学院';
school_option_key[5]['11972'] = '中央司法警官学院';
school_option_key[5]['50004'] = '北华航天工业学院';
school_option_key[5]['50064'] = '河北工程大学';
school_option_key[5]['60003'] = '河北北方学院';
school_option_key[5]['60004'] = '衡水学院';
school_option_key[5]['60011'] = '河北理工大学';
school_option_key[5]['90108'] = '石家庄学院';
school_option_key[5]['90109'] = '邯郸学院';
school_option_key[5]['90110'] = '河北金融学院';
school_option_key[6]['10459'] = '郑州大学';
school_option_key[6]['10462'] = '郑州轻工业学院';
school_option_key[6]['10464'] = '河南科技大学';
school_option_key[6]['10465'] = '中原工学院';
school_option_key[6]['10466'] = '河南农业大学';
school_option_key[6]['10471'] = '河南中医学院';
school_option_key[6]['10472'] = '新乡医学院';
school_option_key[6]['10475'] = '河南大学';
school_option_key[6]['10476'] = '河南师范大学';
school_option_key[6]['10477'] = '信阳师范学院';
school_option_key[6]['10478'] = '周口师范学院';
school_option_key[6]['10479'] = '安阳师范学院';
school_option_key[6]['10480'] = '许昌学院';
school_option_key[6]['10481'] = '南阳师范学院';
school_option_key[6]['10482'] = '洛阳师范学院';
school_option_key[6]['10483'] = '商丘师范学院';
school_option_key[6]['10484'] = '河南财经学院';
school_option_key[6]['10485'] = '郑州航空工业管理学院';
school_option_key[6]['10919'] = '平顶山学院';
school_option_key[6]['11068'] = '中州大学';
school_option_key[6]['11069'] = '开封大学';
school_option_key[6]['11070'] = '洛阳理工学院';
school_option_key[6]['11071'] = '新乡学院';
school_option_key[6]['11522'] = '焦作大学';
school_option_key[6]['11653'] = '南阳理工学院';
school_option_key[6]['11765'] = '平顶山工学院';
school_option_key[6]['20005'] = '解放军信息工程大学';
school_option_key[6]['20009'] = '解放军外国语学院';
school_option_key[6]['20016'] = '郑州防空兵学院';
school_option_key[6]['20056'] = '空军第一航空学院';
school_option_key[6]['30699'] = '河南教育学院';
school_option_key[6]['50070'] = '河南工业大学';
school_option_key[6]['50072'] = '河南理工大学';
school_option_key[6]['50086'] = '华北水利水电学院';
school_option_key[6]['50089'] = '黄淮学院';
school_option_key[6]['60005'] = '河南科技学院';
school_option_key[6]['70017'] = '安阳工学院';
school_option_key[7]['10422'] = '山东大学';
school_option_key[7]['10423'] = '中国海洋大学';
school_option_key[7]['19422'] = '山东大学威海分校';
school_option_key[7]['50059'] = '哈尔滨工业大学（威海）';
school_option_key[7]['50213'] = '中国石油大学(华东)';
school_option_key[7]['10424'] = '山东科技大学';
school_option_key[7]['10426'] = '青岛科技大学';
school_option_key[7]['10430'] = '山东建筑大学';
school_option_key[7]['10431'] = '山东轻工业学院';
school_option_key[7]['10434'] = '山东农业大学';
school_option_key[7]['10435'] = '青岛农业大学';
school_option_key[7]['10438'] = '潍坊医学院';
school_option_key[7]['10439'] = '泰山医学院';
school_option_key[7]['10440'] = '滨州医学院';
school_option_key[7]['10441'] = '山东中医药大学';
school_option_key[7]['10443'] = '济宁医学院';
school_option_key[7]['10445'] = '山东师范大学';
school_option_key[7]['10446'] = '曲阜师范大学';
school_option_key[7]['10447'] = '聊城大学';
school_option_key[7]['10448'] = '德州学院';
school_option_key[7]['10452'] = '临沂师范学院';
school_option_key[7]['10453'] = '泰山学院';
school_option_key[7]['10456'] = '山东经济学院';
school_option_key[7]['10458'] = '山东艺术学院';
school_option_key[7]['10904'] = '枣庄学院';
school_option_key[7]['10908'] = '山东工艺美术学院';
school_option_key[7]['11066'] = '烟台大学';
school_option_key[7]['11510'] = '山东交通学院';
school_option_key[7]['11688'] = '山东工商学院';
school_option_key[7]['11822'] = '山东财政学院';
school_option_key[7]['11906'] = '青岛大学';
school_option_key[7]['11933'] = '潍坊学院';
school_option_key[7]['11944'] = '济南大学';
school_option_key[7]['11970'] = '山东理工大学';
school_option_key[7]['14100'] = '山东政法学院';
school_option_key[7]['31855'] = '山东体育学院';
school_option_key[7]['50141'] = '青岛理工大学';
school_option_key[7]['60008'] = '鲁东大学';
school_option_key[7]['60010'] = '滨州学院';
school_option_key[7]['90111'] = '菏泽学院';
school_option_key[7]['90112'] = '山东警察学院';
school_option_key[7]['90113'] = '济宁学院';
school_option_key[8]['10112'] = '太原理工大学';
school_option_key[8]['10108'] = '山西大学';
school_option_key[8]['10113'] = '山西农业大学';
school_option_key[8]['10114'] = '山西医科大学';
school_option_key[8]['10117'] = '长治医学院';
school_option_key[8]['10118'] = '山西师范大学';
school_option_key[8]['10119'] = '太原师范学院';
school_option_key[8]['10121'] = '晋中学院';
school_option_key[8]['10123'] = '运城学院';
school_option_key[8]['10124'] = '忻州师范学院';
school_option_key[8]['10125'] = '山西财经大学';
school_option_key[8]['10809'] = '山西中医学院';
school_option_key[8]['50166'] = '太原科技大学';
school_option_key[8]['50200'] = '中北大学';
school_option_key[8]['50201'] = '太原工业学院';
school_option_key[8]['60002'] = '山西大同大学';
school_option_key[8]['90115'] = '长治学院';
school_option_key[9]['10357'] = '安徽大学';
school_option_key[9]['10358'] = '中国科学技术大学';
school_option_key[9]['10359'] = '合肥工业大学';
school_option_key[9]['10360'] = '安徽工业大学';
school_option_key[9]['10361'] = '安徽理工大学';
school_option_key[9]['10363'] = '安徽工程科技学院';
school_option_key[9]['10364'] = '安徽农业大学';
school_option_key[9]['10366'] = '安徽医科大学';
school_option_key[9]['10367'] = '蚌埠医学院';
school_option_key[9]['10368'] = '皖南医学院';
school_option_key[9]['10369'] = '安徽中医学院';
school_option_key[9]['10370'] = '安徽师范大学';
school_option_key[9]['10371'] = '阜阳师范学院';
school_option_key[9]['10372'] = '安庆师范学院';
school_option_key[9]['10373'] = '淮北煤炭师范学院';
school_option_key[9]['10375'] = '黄山学院';
school_option_key[9]['10380'] = '巢湖学院';
school_option_key[9]['10381'] = '淮南师范学院';
school_option_key[9]['10383'] = '铜陵学院';
school_option_key[9]['10878'] = '安徽建筑工业学院';
school_option_key[9]['11059'] = '合肥学院';
school_option_key[9]['11932'] = '皖西学院';
school_option_key[9]['50000'] = '安徽财经大学';
school_option_key[9]['60012'] = '安徽科技学院';
school_option_key[9]['90116'] = '滁州学院';
school_option_key[9]['90117'] = '宿州学院';
school_option_key[10]['11902'] = '南昌大学';
school_option_key[10]['10404'] = '华东交通大学';
school_option_key[10]['10405'] = '东华理工学院';
school_option_key[10]['10406'] = '南昌航空大学';
school_option_key[10]['10408'] = '景德镇陶瓷学院';
school_option_key[10]['10410'] = '江西农业大学';
school_option_key[10]['10412'] = '江西中医学院';
school_option_key[10]['10413'] = '赣南医学院';
school_option_key[10]['10414'] = '江西师范大学';
school_option_key[10]['10416'] = '上饶师范学院';
school_option_key[10]['10418'] = '赣南师范学院';
school_option_key[10]['10421'] = '江西财经大学';
school_option_key[10]['11318'] = '江西科技师范学院';
school_option_key[10]['11938'] = '宜春学院';
school_option_key[10]['11955'] = '九江学院';
school_option_key[10]['50105'] = '江西理工大学';
school_option_key[10]['50111'] = '井冈山大学';
school_option_key[10]['50121'] = '南昌大学医学院';
school_option_key[10]['50122'] = '南昌工程学院';
school_option_key[10]['90118'] = '东华理工大学';
school_option_key[11]['10284'] = '南京大学';
school_option_key[11]['10285'] = '苏州大学';
school_option_key[11]['10286'] = '东南大学';
school_option_key[11]['10287'] = '南京航空航天大学';
school_option_key[11]['10288'] = '南京理工大学';
school_option_key[11]['10290'] = '中国矿业大学';
school_option_key[11]['10294'] = '河海大学';
school_option_key[11]['10295'] = '江南大学';
school_option_key[11]['10307'] = '南京农业大学';
school_option_key[11]['10316'] = '中国药科大学';
school_option_key[11]['10319'] = '南京师范大学';
school_option_key[11]['10291'] = '南京工业大学';
school_option_key[11]['10292'] = '江苏工业学院';
school_option_key[11]['10298'] = '南京林业大学';
school_option_key[11]['10299'] = '江苏大学';
school_option_key[11]['10305'] = '盐城工学院';
school_option_key[11]['10312'] = '南京医科大学';
school_option_key[11]['10313'] = '徐州医学院';
school_option_key[11]['10315'] = '南京中医药大学';
school_option_key[11]['10320'] = '徐州师范大学';
school_option_key[11]['10323'] = '淮阴师范学院';
school_option_key[11]['10324'] = '盐城师范学院';
school_option_key[11]['10330'] = '南京体育学院';
school_option_key[11]['10331'] = '南京艺术学院';
school_option_key[11]['10333'] = '常熟理工学院';
school_option_key[11]['11049'] = '淮阴工学院';
school_option_key[11]['11053'] = '徐州工程学院';
school_option_key[11]['11055'] = '常州工学院';
school_option_key[11]['11117'] = '扬州大学';
school_option_key[11]['11287'] = '南京审计学院';
school_option_key[11]['11641'] = '淮海工学院';
school_option_key[11]['11931'] = '南京晓庄学院';
school_option_key[11]['11950'] = '南京工程学院';
school_option_key[11]['11951'] = '苏州科技学院';
school_option_key[11]['20006'] = '解放军理工大学';
school_option_key[11]['50096'] = '江苏科技大学';
school_option_key[11]['50109'] = '金陵科技学院';
school_option_key[11]['50128'] = '南京财经大学';
school_option_key[11]['50133'] = '南京信息工程大学';
school_option_key[11]['50135'] = '南京邮电大学';
school_option_key[11]['50138'] = '南通大学';
school_option_key[11]['50247'] = '西交利物浦大学';
school_option_key[11]['80011'] = '解放军南京政治学院';
school_option_key[11]['80022'] = '中国人民解放军工程兵指挥学院';
school_option_key[12]['10335'] = '浙江大学';
school_option_key[12]['10337'] = '浙江工业大学';
school_option_key[12]['10338'] = '浙江理工大学';
school_option_key[12]['10340'] = '浙江海洋学院';
school_option_key[12]['10341'] = '浙江林学院';
school_option_key[12]['10343'] = '温州医学院';
school_option_key[12]['10344'] = '浙江中医药大学';
school_option_key[12]['10345'] = '浙江师范大学';
school_option_key[12]['10346'] = '杭州师范大学';
school_option_key[12]['10347'] = '湖州师范学院';
school_option_key[12]['10349'] = '绍兴文理学院';
school_option_key[12]['10350'] = '台州学院';
school_option_key[12]['10355'] = '中国美术学院';
school_option_key[12]['10356'] = '中国计量学院';
school_option_key[12]['10876'] = '浙江万里学院';
school_option_key[12]['11057'] = '浙江科技学院';
school_option_key[12]['11058'] = '宁波工程学院';
school_option_key[12]['11292'] = '温州大学';
school_option_key[12]['11482'] = '浙江财经学院';
school_option_key[12]['11646'] = '宁波大学';
school_option_key[12]['11926'] = '嘉兴学院';
school_option_key[12]['30557'] = '浙江教育学院';
school_option_key[12]['50062'] = '杭州电子科技大学';
school_option_key[12]['50197'] = '浙江工商大学';
school_option_key[12]['50240'] = '宁波诺丁汉大学';
school_option_key[12]['90119'] = '丽水学院';
school_option_key[13]['10486'] = '武汉大学';
school_option_key[13]['10504'] = '华中农业大学';
school_option_key[13]['10511'] = '华中师范大学';
school_option_key[13]['11943'] = '中南财经政法大学';
school_option_key[13]['11945'] = '华中科技大学';
school_option_key[13]['11946'] = '武汉理工大学';
school_option_key[13]['50205'] = '中国地质大学(武汉)';
school_option_key[13]['10490'] = '武汉工程大学';
school_option_key[13]['10495'] = '武汉科技学院';
school_option_key[13]['10496'] = '武汉工业学院';
school_option_key[13]['10507'] = '湖北中医学院';
school_option_key[13]['10512'] = '湖北大学';
school_option_key[13]['10513'] = '湖北师范学院';
school_option_key[13]['10514'] = '黄冈师范学院';
school_option_key[13]['10517'] = '湖北民族学院';
school_option_key[13]['10519'] = '襄樊学院';
school_option_key[13]['10522'] = '武汉体育学院';
school_option_key[13]['10523'] = '湖北美术学院';
school_option_key[13]['10524'] = '中南民族大学';
school_option_key[13]['10525'] = '湖北汽车工业学院';
school_option_key[13]['10528'] = '孝感学院';
school_option_key[13]['10927'] = '咸宁学院';
school_option_key[13]['10929'] = '郧阳医学院';
school_option_key[13]['11072'] = '江汉大学';
school_option_key[13]['11074'] = '沙市大学';
school_option_key[13]['11524'] = '武汉音乐学院';
school_option_key[13]['11915'] = '武汉科技大学';
school_option_key[13]['11934'] = '三峡大学';
school_option_key[13]['11958'] = '湖北经济学院';
school_option_key[13]['20044'] = '海军工程大学';
school_option_key[13]['30760'] = '湖北第二师范学院';
school_option_key[13]['30762'] = '十堰教育学院';
school_option_key[13]['50036'] = '长江大学';
school_option_key[13]['50230'] = '湖北工业大学';
school_option_key[13]['70051'] = '黄石理工学院';
school_option_key[13]['80007'] = '解放军军事经济学院';
school_option_key[14]['10532'] = '湖南大学';
school_option_key[14]['10542'] = '湖南师范大学';
school_option_key[14]['11942'] = '中南大学';
school_option_key[14]['20002'] = '国防科学技术大学';
school_option_key[14]['10530'] = '湘潭大学';
school_option_key[14]['10531'] = '吉首大学';
school_option_key[14]['10537'] = '湖南农业大学';
school_option_key[14]['10538'] = '中南林业科技大学';
school_option_key[14]['10541'] = '湖南中医药大学';
school_option_key[14]['10543'] = '湖南理工学院';
school_option_key[14]['10546'] = '衡阳师范学院';
school_option_key[14]['10548'] = '怀化学院';
school_option_key[14]['10549'] = '湖南文理学院';
school_option_key[14]['10554'] = '湖南商学院';
school_option_key[14]['11936'] = '南华大学';
school_option_key[14]['11949'] = '湖南工程学院';
school_option_key[14]['11962'] = '邵阳学院';
school_option_key[14]['11966'] = '湖南城市学院';
school_option_key[14]['50039'] = '长沙理工大学';
school_option_key[14]['50041'] = '长沙学院';
school_option_key[14]['50079'] = '湖南工业大学';
school_option_key[14]['50081'] = '湖南科技大学';
school_option_key[14]['90121'] = '湘南学院';
school_option_key[15]['10558'] = '中山大学';
school_option_key[15]['10559'] = '暨南大学';
school_option_key[15]['10560'] = '汕头大学';
school_option_key[15]['10561'] = '华南理工大学';
school_option_key[15]['10564'] = '华南农业大学';
school_option_key[15]['10572'] = '广州中医药大学';
school_option_key[15]['10574'] = '华南师范大学';
school_option_key[15]['10566'] = '广东海洋大学';
school_option_key[15]['10570'] = '广州医学院';
school_option_key[15]['10571'] = '广东医学院';
school_option_key[15]['10573'] = '广东药学院';
school_option_key[15]['10576'] = '韶关学院';
school_option_key[15]['10577'] = '惠州学院';
school_option_key[15]['10578'] = '韩山师范学院';
school_option_key[15]['10579'] = '湛江师范学院';
school_option_key[15]['10580'] = '肇庆学院';
school_option_key[15]['10581'] = '惠州大学';
school_option_key[15]['10582'] = '嘉应学院';
school_option_key[15]['10585'] = '广州体育学院';
school_option_key[15]['10586'] = '广州美术学院';
school_option_key[15]['10587'] = '星海音乐学院';
school_option_key[15]['10588'] = '广东技术师范学院';
school_option_key[15]['10590'] = '深圳大学';
school_option_key[15]['10592'] = '广东商学院';
school_option_key[15]['11078'] = '广州大学';
school_option_key[15]['11110'] = '广东警官学院';
school_option_key[15]['11347'] = '仲恺农业技术学院';
school_option_key[15]['11349'] = '五邑大学';
school_option_key[15]['11656'] = '茂名学院';
school_option_key[15]['11819'] = '东莞理工学院';
school_option_key[15]['11909'] = '佛山科学技术学院';
school_option_key[15]['11910'] = '广东外语外贸大学';
school_option_key[15]['11911'] = '广东工业大学';
school_option_key[15]['50054'] = '广东金融学院';
school_option_key[15]['80021'] = '南方医科大学';
school_option_key[16]['10593'] = '广西大学';
school_option_key[16]['10594'] = '广西工学院';
school_option_key[16]['10595'] = '桂林电子科技大学';
school_option_key[16]['10596'] = '桂林工学院';
school_option_key[16]['10598'] = '广西医科大学';
school_option_key[16]['10599'] = '右江民族医学院';
school_option_key[16]['10600'] = '广西中医学院';
school_option_key[16]['10601'] = '桂林医学院';
school_option_key[16]['10602'] = '广西师范大学';
school_option_key[16]['10603'] = '广西师范学院';
school_option_key[16]['10605'] = '河池学院';
school_option_key[16]['10606'] = '玉林师范学院';
school_option_key[16]['10607'] = '广西艺术学院';
school_option_key[16]['10608'] = '广西民族大学';
school_option_key[16]['10609'] = '百色学院';
school_option_key[16]['20054'] = '桂林空军学院';
school_option_key[16]['50055'] = '广西财经学院';
school_option_key[16]['60001'] = '梧州学院';
school_option_key[16]['90122'] = '贺州学院';
school_option_key[16]['90123'] = '钦州学院';
school_option_key[17]['10673'] = '云南大学';
school_option_key[17]['10674'] = '昆明理工大学';
school_option_key[17]['10676'] = '云南农业大学';
school_option_key[17]['10677'] = '西南林学院';
school_option_key[17]['10678'] = '昆明医学院';
school_option_key[17]['10679'] = '大理学院';
school_option_key[17]['10680'] = '云南中医学院';
school_option_key[17]['10681'] = '云南师范大学';
school_option_key[17]['10684'] = '曲靖师范学院';
school_option_key[17]['10690'] = '云南艺术学院';
school_option_key[17]['11390'] = '玉溪师范学院';
school_option_key[17]['11391'] = '楚雄师范学院';
school_option_key[17]['50075'] = '红河学院';
school_option_key[17]['50228'] = '云南民族大学';
school_option_key[17]['50237'] = '云南财经大学';
school_option_key[18]['10657'] = '贵州大学';
school_option_key[18]['10660'] = '贵阳医学院';
school_option_key[18]['10661'] = '遵义医学院';
school_option_key[18]['10662'] = '贵阳中医学院';
school_option_key[18]['10663'] = '贵州师范大学';
school_option_key[18]['10664'] = '遵义师范学院';
school_option_key[18]['10670'] = '黔南民族师范学院';
school_option_key[18]['10671'] = '贵州财经学院';
school_option_key[18]['10672'] = '贵州民族学院';
school_option_key[19]['10613'] = '西南交通大学';
school_option_key[19]['10614'] = '电子科技大学';
school_option_key[19]['10626'] = '四川农业大学';
school_option_key[19]['10651'] = '西南财经大学';
school_option_key[19]['11901'] = '四川大学';
school_option_key[19]['10615'] = '西南石油大学';
school_option_key[19]['10616'] = '成都理工大学';
school_option_key[19]['10619'] = '西南科技大学';
school_option_key[19]['10621'] = '成都信息工程学院';
school_option_key[19]['10624'] = '中国民用航空飞行学院';
school_option_key[19]['10632'] = '泸州医学院';
school_option_key[19]['10633'] = '成都中医药大学';
school_option_key[19]['10634'] = '川北医学院';
school_option_key[19]['10636'] = '四川师范大学';
school_option_key[19]['10639'] = '绵阳师范学院';
school_option_key[19]['10640'] = '内江师范学院';
school_option_key[19]['10641'] = '宜宾学院';
school_option_key[19]['10644'] = '四川文理学院';
school_option_key[19]['10649'] = '乐山师范学院';
school_option_key[19]['10653'] = '成都体育学院';
school_option_key[19]['10654'] = '四川音乐学院';
school_option_key[19]['11079'] = '成都大学';
school_option_key[19]['11360'] = '攀枝花学院';
school_option_key[19]['11937'] = '四川警察学院';
school_option_key[19]['13705'] = '成都医学院';
school_option_key[19]['19947'] = '四川理工学院';
school_option_key[19]['50185'] = '西华师范大学';
school_option_key[19]['50186'] = '西南民族大学';
school_option_key[19]['50232'] = '西华大学';
school_option_key[19]['90127'] = '西昌学院';
school_option_key[20]['10697'] = '西北大学';
school_option_key[20]['10698'] = '西安交通大学';
school_option_key[20]['10699'] = '西北工业大学';
school_option_key[20]['10701'] = '西安电子科技大学';
school_option_key[20]['10718'] = '陕西师范大学';
school_option_key[20]['11924'] = '西北农林科技大学';
school_option_key[20]['11941'] = '长安大学';
school_option_key[20]['20036'] = '第四军医大学';
school_option_key[20]['10700'] = '西安理工大学';
school_option_key[20]['10702'] = '西安工业大学';
school_option_key[20]['10703'] = '西安建筑科技大学';
school_option_key[20]['10708'] = '陕西科技大学';
school_option_key[20]['10709'] = '西安工程大学';
school_option_key[20]['10716'] = '陕西中医学院';
school_option_key[20]['10719'] = '延安大学';
school_option_key[20]['10722'] = '咸阳师范学院';
school_option_key[20]['10723'] = '渭南师范学院';
school_option_key[20]['10724'] = '西安外国语大学';
school_option_key[20]['10727'] = '西安体育学院';
school_option_key[20]['10728'] = '西安音乐学院';
school_option_key[20]['10729'] = '西安美术学院';
school_option_key[20]['11664'] = '西安邮电学院';
school_option_key[20]['11905'] = '宝鸡文理学院';
school_option_key[20]['11952'] = '陕西理工学院';
school_option_key[20]['11953'] = '西安财经学院';
school_option_key[20]['20012'] = '解放军西安通信学院';
school_option_key[20]['20023'] = '西安政治学院';
school_option_key[20]['20052'] = '空军工程大学';
school_option_key[20]['50179'] = '西安科技大学';
school_option_key[20]['50181'] = '西安石油大学';
school_option_key[20]['50182'] = '西安文理学院';
school_option_key[20]['90128'] = '榆林学院';
school_option_key[20]['90129'] = '西安医学院';
school_option_key[20]['90130'] = '西北政法大学';
school_option_key[20]['90131'] = '安康学院';
school_option_key[21]['10743'] = '青海大学';
school_option_key[21]['10746'] = '青海师范大学';
school_option_key[21]['10748'] = '青海民族学院';
school_option_key[22]['10749'] = '宁夏大学';
school_option_key[22]['10752'] = '宁夏医学院';
school_option_key[22]['11407'] = '北方民族大学';
school_option_key[22]['90132'] = '宁夏师范学院';
school_option_key[23]['10213'] = '哈尔滨工业大学';
school_option_key[23]['10217'] = '哈尔滨工程大学';
school_option_key[23]['10225'] = '东北林业大学';
school_option_key[23]['19946'] = '东北农业大学';
school_option_key[23]['10212'] = '黑龙江大学';
school_option_key[23]['10219'] = '黑龙江科技学院';
school_option_key[23]['10220'] = '大庆石油学院';
school_option_key[23]['10221'] = '齐齐哈尔大学';
school_option_key[23]['10223'] = '黑龙江八一农垦大学';
school_option_key[23]['10228'] = '黑龙江中医药大学';
school_option_key[23]['10229'] = '牡丹江医学院';
school_option_key[23]['10231'] = '哈尔滨师范大学';
school_option_key[23]['10233'] = '牡丹江师范学院';
school_option_key[23]['10236'] = '绥化学院';
school_option_key[23]['10240'] = '哈尔滨商业大学';
school_option_key[23]['10242'] = '哈尔滨体育学院';
school_option_key[23]['11230'] = '齐齐哈尔医学院';
school_option_key[23]['11444'] = '佳木斯大学';
school_option_key[23]['11914'] = '哈尔滨理工大学';
school_option_key[23]['11929'] = '哈尔滨学院';
school_option_key[23]['11930'] = '黑龙江工程学院';
school_option_key[23]['13744'] = '黑河学院';
school_option_key[24]['10183'] = '吉林大学';
school_option_key[24]['10184'] = '延边大学';
school_option_key[24]['10200'] = '东北师范大学';
school_option_key[24]['10186'] = '长春理工大学';
school_option_key[24]['10188'] = '东北电力大学';
school_option_key[24]['10190'] = '长春工业大学';
school_option_key[24]['10191'] = '吉林建筑工程学院';
school_option_key[24]['10192'] = '吉林化工学院';
school_option_key[24]['10193'] = '吉林农业大学';
school_option_key[24]['10202'] = '通化师范学院';
school_option_key[24]['10203'] = '吉林师范大学';
school_option_key[24]['10204'] = '吉林工程技术师范学院';
school_option_key[24]['10205'] = '长春师范学院';
school_option_key[24]['10206'] = '白城师范学院';
school_option_key[24]['10207'] = '长春税务学院';
school_option_key[24]['10208'] = '吉林体育学院';
school_option_key[24]['10209'] = '吉林艺术学院';
school_option_key[24]['11726'] = '长春大学';
school_option_key[24]['11923'] = '北华大学';
school_option_key[24]['11927'] = '长春工程学院';
school_option_key[24]['13706'] = '吉林医药学院';
school_option_key[24]['50091'] = '吉林华侨外国语学院';
school_option_key[24]['50234'] = '长春中医药大学';
school_option_key[24]['60007'] = '吉林农业科技学院';
school_option_key[24]['90133'] = '吉林工商学院';
school_option_key[25]['10140'] = '辽宁大学';
school_option_key[25]['10141'] = '大连理工大学';
school_option_key[25]['10145'] = '东北大学';
school_option_key[25]['10151'] = '大连海事大学';
school_option_key[25]['10142'] = '沈阳工业大学';
school_option_key[25]['10143'] = '沈阳航空工业学院';
school_option_key[25]['10146'] = '辽宁科技大学';
school_option_key[25]['10147'] = '辽宁工程技术大学';
school_option_key[25]['10148'] = '辽宁石油化工大学';
school_option_key[25]['10149'] = '沈阳化工学院';
school_option_key[25]['10152'] = '大连工业大学';
school_option_key[25]['10154'] = '辽宁工业大学';
school_option_key[25]['10157'] = '沈阳农业大学';
school_option_key[25]['10158'] = '大连水产学院';
school_option_key[25]['10159'] = '中国医科大学';
school_option_key[25]['10160'] = '辽宁医学院';
school_option_key[25]['10161'] = '大连医科大学';
school_option_key[25]['10162'] = '辽宁中医药大学';
school_option_key[25]['10163'] = '沈阳药科大学';
school_option_key[25]['10164'] = '沈阳医学院';
school_option_key[25]['10165'] = '辽宁师范大学';
school_option_key[25]['10166'] = '沈阳师范大学';
school_option_key[25]['10169'] = '鞍山师范学院';
school_option_key[25]['10172'] = '大连外国语学院';
school_option_key[25]['10173'] = '东北财经大学';
school_option_key[25]['10175'] = '中国刑事警察学院';
school_option_key[25]['10176'] = '沈阳体育学院';
school_option_key[25]['10177'] = '沈阳音乐学院';
school_option_key[25]['10178'] = '鲁迅美术学院';
school_option_key[25]['11035'] = '沈阳大学';
school_option_key[25]['11257'] = '大连民族学院';
school_option_key[25]['11258'] = '大连大学';
school_option_key[25]['19948'] = '辽东学院';
school_option_key[25]['50045'] = '大连交通大学';
school_option_key[25]['50154'] = '沈阳建筑大学';
school_option_key[25]['50155'] = '沈阳理工大学';
school_option_key[25]['70074'] = '渤海大学';
school_option_key[26]['10694'] = '西藏大学';
school_option_key[26]['10695'] = '西藏民族学院';
school_option_key[26]['10696'] = '西藏藏医学院';
school_option_key[27]['10755'] = '新疆大学';
school_option_key[27]['10759'] = '石河子大学';
school_option_key[27]['10757'] = '塔里木大学';
school_option_key[27]['10758'] = '新疆农业大学';
school_option_key[27]['10762'] = '新疆师范大学';
school_option_key[27]['10763'] = '喀什师范学院';
school_option_key[27]['10764'] = '伊犁师范学院';
school_option_key[27]['10766'] = '新疆财经学院';
school_option_key[27]['10768'] = '新疆艺术学院';
school_option_key[27]['10997'] = '昌吉学院';
school_option_key[27]['11925'] = '新疆医科大学';
school_option_key[27]['50239'] = '新疆财经大学';
school_option_key[28]['10126'] = '内蒙古大学';
school_option_key[28]['10128'] = '内蒙古工业大学';
school_option_key[28]['10132'] = '内蒙古医学院';
school_option_key[28]['10133'] = '包头医学院';
school_option_key[28]['10135'] = '内蒙古师范大学';
school_option_key[28]['10139'] = '内蒙古财经学院';
school_option_key[28]['10819'] = '呼伦贝尔学院';
school_option_key[28]['11922'] = '内蒙古农业大学';
school_option_key[28]['11947'] = '内蒙古民族大学';
school_option_key[28]['18127'] = '内蒙古科技大学包头师范学院';
school_option_key[28]['50118'] = '内蒙古科技大学';
school_option_key[29]['10589'] = '海南大学';
school_option_key[29]['10565'] = '华南热带农业大学';
school_option_key[29]['11658'] = '海南师范大学';
school_option_key[29]['11810'] = '海南医学院';
school_option_key[29]['90135'] = '琼州学院';
school_option_key[30]['10384'] = '厦门大学';
school_option_key[30]['10386'] = '福州大学';
school_option_key[30]['10385'] = '华侨大学';
school_option_key[30]['10388'] = '福建工程学院';
school_option_key[30]['10392'] = '福建医科大学';
school_option_key[30]['10393'] = '福建中医学院';
school_option_key[30]['10394'] = '福建师范大学';
school_option_key[30]['10395'] = '闽江学院';
school_option_key[30]['10399'] = '泉州师范学院';
school_option_key[30]['10402'] = '漳州师范学院';
school_option_key[30]['11498'] = '莆田学院';
school_option_key[30]['11900'] = '集美大学';
school_option_key[30]['11948'] = '福建农林大学';
school_option_key[30]['50233'] = '厦门理工学院';
school_option_key[30]['90136'] = '三明学院';
school_option_key[30]['90137'] = '龙岩学院';
school_option_key[31]['10730'] = '兰州大学';
school_option_key[31]['10731'] = '兰州理工大学';
school_option_key[31]['10733'] = '甘肃农业大学';
school_option_key[31]['10735'] = '甘肃中医学院';
school_option_key[31]['10736'] = '西北师范大学';
school_option_key[31]['10739'] = '天水师范学院';
school_option_key[31]['10740'] = '河西学院';
school_option_key[31]['10741'] = '兰州商学院';
school_option_key[31]['11406'] = '甘肃政法学院';
school_option_key[31]['11562'] = '甘肃联合大学';
school_option_key[31]['50114'] = '兰州交通大学';
school_option_key[31]['50184'] = '西北民族大学';
school_option_key[31]['90138'] = '陇东学院';
school_option_key[32]['50189'] = '香港城市大学';
school_option_key[32]['50190'] = '香港中文大学';
school_option_key[32]['50241'] = '香港科技大学';
school_option_key[32]['50242'] = '香港大学';
school_option_key[32]['50243'] = '香港理工大学';
school_option_key[32]['50244'] = '香港浸会大学';
school_option_key[32]['50245'] = '香港岭南大学';
school_option_key[32]['50246'] = '香港教育学院';
school_option_key[32]['90280'] = '澳门大学';
school_option_key[32]['90282'] = '澳门科技大学';
school_option_key[32]['90311'] = '澳门旅游学院';

function $(id)
{
	return document.getElementById(id);
}

function setCategory1()
{
	$('c1').options.length = 1;
	for (var i = 0; i < category1.length; i++)
	{
		var op = new Option(category1[i]);
		$('c1').options.add(op);
	}

	$('c3').options.length = 1;
	for (var i = 0; i < category1.length; i++)
	{
		var op = new Option(category1[i]);
		$('c3').options.add(op);
	}
}
function setCategory2(id)
{
	$('c2').options.length = 1;
	for (var i = 0; i < category2[id].length; i++)
	{
		var op = new Option(category2[id][i]);
		$('c2').options.add(op);
	}
}
function setCategory3(id)
{
	$('c4').options.length = 1;
	for (var i = 0; i < category2[id].length; i++)
	{
		var op = new Option(category2[id][i]);
		$('c4').options.add(op);
	}
}

//大学搜索
function searchCollege(objId, keyword, id)
{
	var str = ''
	var i = 1;
	for (var x in college)
	{
		if (college[x].indexOf(keyword) > -1)
		{
			if (college[x].length > 9)
			{
				var v = college[x].substring(0, 8) + '...';
			}
			else
			{
				var v = college[x];
			}
			str += '<li><a href="javascript:;" onclick="ca(\'' + objId + '\', \'' + college[x] + '\')">' + v.replace(keyword, '<strong>' + keyword + '</strong>'); + '</a></li>'
			if (i++ >= 10)
			{
				break;
			}
		}
	}
	if (str != '')
	{
		$(id).innerHTML = str;
		$(id).style.display = '';
	}
}

//专业搜索
function searchSpeciality(objId, keyword, id)
{
	var str = ''
	var i = 1;
	for (var x in speciality)
	{
		if (speciality[x].indexOf(keyword) > -1)
		{
			if (speciality[x].length > 9)
			{
				var v = speciality[x].substring(0, 8) + '...';
			}
			else
			{
				var v = speciality[x];
			}
			str += '<li><a href="javascript:;" onclick="ca(\'' + objId + '\', \'' + speciality[x] + '\')">' + v.replace(keyword, '<strong>' + keyword + '</strong>'); + '</a></li>'
			if (i++ >= 10)
			{
				break;
			}
		}
	}
	if (str != '')
	{
		$(id).innerHTML = str;
		$(id).style.display = '';
	}
}

function ca(id, val)
{
	$(id).value = val;
}

var key1 = '';
$('v1').onkeyup = function(){
	var newKey1 = $('v1').value;
	if (newKey1 != '' && newKey1 != key1)
	{
		searchCollege(this.id, newKey1, 'college');
		key1 = $('v1').value;
	}
};
var key2 = '';
$('v2').onkeyup = function(){
	var newKey2 = $('v2').value;
	if (newKey2 != '' && newKey2 != key2)
	{
		searchSpeciality(this.id, newKey2, 'speciality');
		key2 = $('v2').value;
	}
};

var key62 = '';
$('v62').onkeyup = function(){
	var newKey62 = $('v62').value;
	if (newKey62 != '' && newKey62 != key62)
	{
		searchCollege(this.id, newKey62, 'college6');
		key62 = $('v62').value;
	}
};

document.onmouseup = function(){
	$('college').style.display = 'none';
	$('speciality').style.display = 'none';
	$('college6').style.display = 'none';
};

function fcollege()
{
	var val = $("cat_select").value;
	if (val != ""){
		if (val == "本科"){
			$('cat').name = 'benzhuan';
			$('cat').value = '1';
		}
		else if (val == "专科"){
			$('cat').name = 'benzhuan';
			$('cat').value = '2';
		}
		else if (val == "独立"){
			$('cat').name = 'is_independ';
			$('cat').value = '1';
		}
		else if (val == "教育部直属"){
			$('cat').name = 'is_zhishu';
			$('cat').value = '1';
		}
		else if (val == "211工程"){
			$('cat').name = 'is211';
			$('cat').value = '是';
		}
		else if (val == "985工程"){
			$('cat').name = 'is985';
			$('cat').value = '是';
		}
		else if (val == "开设研究生院高校"){
			$('cat').name = 'is_yjs';
			$('cat').value = '1';
		}
		else if (val == "民办高校"){
			$('cat').name = 'is_minban';
			$('cat').value = '1';
		}
		else{
			$('cat').name = '';
			$('cat').value = '';
		}
	}
	if ($('v1').value == '输入大学名或不填')
	{
		$('v1').name = '';
	}
	else
	{
		$('v1').name = 'name';
	}
	$('fm1').submit();
}

function fspeciality()
{
	if ($('v2').value == '输入专业名或不填')
	{
		$('v2').name = '';
	}
	else
	{
		$('v2').name = 'majorname';
	}
	$('fm2').submit();
}

function fspeciality2()
{
	if ($('v3').value == '输入专业名或不填')
	{
		$('v3').name = '';
	}
	else
	{
		$('v3').name = 'majorname';
	}
	$('fm3').submit();
}

function prov(id)
{
	$('tag3_college').options.length = 0;
	if (id != '')
	{
		for (var x in school_option_key[id])
		{
			var opt = new Option(school_option_key[id][x], x);
			$('tag3_college').options.add(opt);
		}
	}
	else
	{
		var opt = new Option('大学', '');
		$('tag3_college').options.add(opt);
	}
}

function fm6()
{
	if ($('v61').value == '专业名')
	{
		$('v61').name = '';
	}
	else
	{
		$('v61').name = 'majorname';
	}

	if ($('v62').value == '院校名')
	{
		$('v62').name = '';
	}
	else
	{
		$('v62').name = 'collegename';
	}
	$('fm6').submit();
}